program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.11.1"}, {"coremlc-version", "3500.21.1"}, {"coremltools-component-torch", "2.7.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 80, 1, 3000]> melspectrogram_features) {
            tensor<string, []> var_54_pad_type_0 = const()[name = tensor<string, []>("op_54_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_54_pad_0 = const()[name = tensor<string, []>("op_54_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> var_54_strides_0 = const()[name = tensor<string, []>("op_54_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_54_dilations_0 = const()[name = tensor<string, []>("op_54_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_54_groups_0 = const()[name = tensor<string, []>("op_54_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 80, 1, 3]> var_29_to_fp16 = const()[name = tensor<string, []>("op_29_to_fp16"), val = tensor<fp16, [512, 80, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [512]> var_35_to_fp16 = const()[name = tensor<string, []>("op_35_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(245888)))];
            tensor<fp16, [1, 512, 1, 3000]> var_54_cast_fp16 = conv(bias = var_35_to_fp16, dilations = var_54_dilations_0, groups = var_54_groups_0, pad = var_54_pad_0, pad_type = var_54_pad_type_0, strides = var_54_strides_0, weight = var_29_to_fp16, x = melspectrogram_features)[name = tensor<string, []>("op_54_cast_fp16")];
            tensor<string, []> hidden_states_1_mode_0 = const()[name = tensor<string, []>("hidden_states_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1, 3000]> hidden_states_1_cast_fp16 = gelu(mode = hidden_states_1_mode_0, x = var_54_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<string, []> var_94_pad_type_0 = const()[name = tensor<string, []>("op_94_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_94_pad_0 = const()[name = tensor<string, []>("op_94_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> var_94_strides_0 = const()[name = tensor<string, []>("op_94_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_94_dilations_0 = const()[name = tensor<string, []>("op_94_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_94_groups_0 = const()[name = tensor<string, []>("op_94_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 3]> var_69_to_fp16 = const()[name = tensor<string, []>("op_69_to_fp16"), val = tensor<fp16, [512, 512, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(246976)))];
            tensor<fp16, [512]> var_75_to_fp16 = const()[name = tensor<string, []>("op_75_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1819904)))];
            tensor<fp16, [1, 512, 1, 1500]> var_94_cast_fp16 = conv(bias = var_75_to_fp16, dilations = var_94_dilations_0, groups = var_94_groups_0, pad = var_94_pad_0, pad_type = var_94_pad_type_0, strides = var_94_strides_0, weight = var_69_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_94_cast_fp16")];
            tensor<string, []> hidden_states_3_mode_0 = const()[name = tensor<string, []>("hidden_states_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1, 1500]> hidden_states_3_cast_fp16 = gelu(mode = hidden_states_3_mode_0, x = var_94_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> var_112_to_fp16 = const()[name = tensor<string, []>("op_112_to_fp16"), val = tensor<fp16, [1, 512, 1, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1820992)))];
            tensor<fp16, [1, 512, 1, 1500]> inputs_1_cast_fp16 = add(x = hidden_states_3_cast_fp16, y = var_112_to_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_125 = const()[name = tensor<string, []>("op_125"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_138 = const()[name = tensor<string, []>("op_138"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> out_1_axes_0 = const()[name = tensor<string, []>("out_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_155_to_fp16 = const()[name = tensor<string, []>("op_155_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> out_1_cast_fp16 = layer_norm(axes = out_1_axes_0, epsilon = var_155_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [512]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3357056)))];
            tensor<fp16, [512]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3358144)))];
            tensor<fp16, [512]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3359232)))];
            tensor<fp16, [512]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3360320)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<string, []> query_1_pad_type_0 = const()[name = tensor<string, []>("query_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> query_1_strides_0 = const()[name = tensor<string, []>("query_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> query_1_pad_0 = const()[name = tensor<string, []>("query_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> query_1_dilations_0 = const()[name = tensor<string, []>("query_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> query_1_groups_0 = const()[name = tensor<string, []>("query_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3361408)))];
            tensor<fp16, [512]> layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3885760)))];
            tensor<fp16, [1, 512, 1, 1500]> query_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_bias_to_fp16, dilations = query_1_dilations_0, groups = query_1_groups_0, pad = query_1_pad_0, pad_type = query_1_pad_type_0, strides = query_1_strides_0, weight = layers_0_self_attn_q_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<string, []> key_1_pad_type_0 = const()[name = tensor<string, []>("key_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> key_1_strides_0 = const()[name = tensor<string, []>("key_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> key_1_pad_0 = const()[name = tensor<string, []>("key_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> key_1_dilations_0 = const()[name = tensor<string, []>("key_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> key_1_groups_0 = const()[name = tensor<string, []>("key_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3886848)))];
            tensor<fp16, [1, 512, 1, 1500]> key_1_cast_fp16 = conv(dilations = key_1_dilations_0, groups = key_1_groups_0, pad = key_1_pad_0, pad_type = key_1_pad_type_0, strides = key_1_strides_0, weight = layers_0_self_attn_k_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<string, []> value_1_pad_type_0 = const()[name = tensor<string, []>("value_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> value_1_strides_0 = const()[name = tensor<string, []>("value_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> value_1_pad_0 = const()[name = tensor<string, []>("value_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> value_1_dilations_0 = const()[name = tensor<string, []>("value_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> value_1_groups_0 = const()[name = tensor<string, []>("value_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4411200)))];
            tensor<fp16, [512]> layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4935552)))];
            tensor<fp16, [1, 512, 1, 1500]> value_1_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_bias_to_fp16, dilations = value_1_dilations_0, groups = value_1_groups_0, pad = value_1_pad_0, pad_type = value_1_pad_type_0, strides = value_1_strides_0, weight = layers_0_self_attn_v_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_190_begin_0 = const()[name = tensor<string, []>("op_190_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_190_end_0 = const()[name = tensor<string, []>("op_190_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_190_end_mask_0 = const()[name = tensor<string, []>("op_190_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_190_cast_fp16 = slice_by_index(begin = var_190_begin_0, end = var_190_end_0, end_mask = var_190_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<int32, [4]> var_194_begin_0 = const()[name = tensor<string, []>("op_194_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_194_end_0 = const()[name = tensor<string, []>("op_194_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1500])];
            tensor<bool, [4]> var_194_end_mask_0 = const()[name = tensor<string, []>("op_194_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_194_cast_fp16 = slice_by_index(begin = var_194_begin_0, end = var_194_end_0, end_mask = var_194_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_194_cast_fp16")];
            tensor<int32, [4]> var_198_begin_0 = const()[name = tensor<string, []>("op_198_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_198_end_0 = const()[name = tensor<string, []>("op_198_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1500])];
            tensor<bool, [4]> var_198_end_mask_0 = const()[name = tensor<string, []>("op_198_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_198_cast_fp16 = slice_by_index(begin = var_198_begin_0, end = var_198_end_0, end_mask = var_198_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<int32, [4]> var_202_begin_0 = const()[name = tensor<string, []>("op_202_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_202_end_0 = const()[name = tensor<string, []>("op_202_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1500])];
            tensor<bool, [4]> var_202_end_mask_0 = const()[name = tensor<string, []>("op_202_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_202_cast_fp16 = slice_by_index(begin = var_202_begin_0, end = var_202_end_0, end_mask = var_202_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<int32, [4]> var_206_begin_0 = const()[name = tensor<string, []>("op_206_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_206_end_0 = const()[name = tensor<string, []>("op_206_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1500])];
            tensor<bool, [4]> var_206_end_mask_0 = const()[name = tensor<string, []>("op_206_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_206_cast_fp16 = slice_by_index(begin = var_206_begin_0, end = var_206_end_0, end_mask = var_206_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [4]> var_210_begin_0 = const()[name = tensor<string, []>("op_210_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_210_end_0 = const()[name = tensor<string, []>("op_210_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1500])];
            tensor<bool, [4]> var_210_end_mask_0 = const()[name = tensor<string, []>("op_210_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_210_cast_fp16 = slice_by_index(begin = var_210_begin_0, end = var_210_end_0, end_mask = var_210_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [4]> var_214_begin_0 = const()[name = tensor<string, []>("op_214_begin_0"), val = tensor<int32, [4]>([0, 384, 0, 0])];
            tensor<int32, [4]> var_214_end_0 = const()[name = tensor<string, []>("op_214_end_0"), val = tensor<int32, [4]>([1, 448, 1, 1500])];
            tensor<bool, [4]> var_214_end_mask_0 = const()[name = tensor<string, []>("op_214_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_214_cast_fp16 = slice_by_index(begin = var_214_begin_0, end = var_214_end_0, end_mask = var_214_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<int32, [4]> var_218_begin_0 = const()[name = tensor<string, []>("op_218_begin_0"), val = tensor<int32, [4]>([0, 448, 0, 0])];
            tensor<int32, [4]> var_218_end_0 = const()[name = tensor<string, []>("op_218_end_0"), val = tensor<int32, [4]>([1, 1, 1, 1500])];
            tensor<bool, [4]> var_218_end_mask_0 = const()[name = tensor<string, []>("op_218_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_218_cast_fp16 = slice_by_index(begin = var_218_begin_0, end = var_218_end_0, end_mask = var_218_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_218_cast_fp16")];
            tensor<int32, [4]> var_221_begin_0 = const()[name = tensor<string, []>("op_221_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_221_end_0 = const()[name = tensor<string, []>("op_221_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_221_end_mask_0 = const()[name = tensor<string, []>("op_221_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_221_cast_fp16 = slice_by_index(begin = var_221_begin_0, end = var_221_end_0, end_mask = var_221_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<int32, [4]> var_222_begin_0 = const()[name = tensor<string, []>("op_222_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_222_end_0 = const()[name = tensor<string, []>("op_222_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_222_end_mask_0 = const()[name = tensor<string, []>("op_222_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_222_cast_fp16 = slice_by_index(begin = var_222_begin_0, end = var_222_end_0, end_mask = var_222_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_222_cast_fp16")];
            tensor<int32, [4]> var_223_begin_0 = const()[name = tensor<string, []>("op_223_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_223_end_0 = const()[name = tensor<string, []>("op_223_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_223_end_mask_0 = const()[name = tensor<string, []>("op_223_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_223_cast_fp16 = slice_by_index(begin = var_223_begin_0, end = var_223_end_0, end_mask = var_223_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<int32, [4]> var_224_begin_0 = const()[name = tensor<string, []>("op_224_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_224_end_0 = const()[name = tensor<string, []>("op_224_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_224_end_mask_0 = const()[name = tensor<string, []>("op_224_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_224_cast_fp16 = slice_by_index(begin = var_224_begin_0, end = var_224_end_0, end_mask = var_224_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_224_cast_fp16")];
            tensor<int32, [4]> var_225_begin_0 = const()[name = tensor<string, []>("op_225_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_225_end_0 = const()[name = tensor<string, []>("op_225_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_225_end_mask_0 = const()[name = tensor<string, []>("op_225_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_225_cast_fp16 = slice_by_index(begin = var_225_begin_0, end = var_225_end_0, end_mask = var_225_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<int32, [4]> var_226_begin_0 = const()[name = tensor<string, []>("op_226_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_226_end_0 = const()[name = tensor<string, []>("op_226_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_226_end_mask_0 = const()[name = tensor<string, []>("op_226_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_226_cast_fp16 = slice_by_index(begin = var_226_begin_0, end = var_226_end_0, end_mask = var_226_end_mask_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<int32, [4]> var_227_begin_0 = const()[name = tensor<string, []>("op_227_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_227_end_0 = const()[name = tensor<string, []>("op_227_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_227_end_mask_0 = const()[name = tensor<string, []>("op_227_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_227_cast_fp16 = slice_by_index(begin = var_227_begin_0, end = var_227_end_0, end_mask = var_227_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_227_cast_fp16")];
            tensor<int32, [4]> var_228_begin_0 = const()[name = tensor<string, []>("op_228_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_228_end_0 = const()[name = tensor<string, []>("op_228_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_228_end_mask_0 = const()[name = tensor<string, []>("op_228_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_228_cast_fp16 = slice_by_index(begin = var_228_begin_0, end = var_228_end_0, end_mask = var_228_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<int32, [4]> var_229_begin_0 = const()[name = tensor<string, []>("op_229_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_229_end_0 = const()[name = tensor<string, []>("op_229_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_229_end_mask_0 = const()[name = tensor<string, []>("op_229_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_229_cast_fp16 = slice_by_index(begin = var_229_begin_0, end = var_229_end_0, end_mask = var_229_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_229_cast_fp16")];
            tensor<int32, [4]> var_230_begin_0 = const()[name = tensor<string, []>("op_230_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_230_end_0 = const()[name = tensor<string, []>("op_230_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_230_end_mask_0 = const()[name = tensor<string, []>("op_230_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_230_cast_fp16 = slice_by_index(begin = var_230_begin_0, end = var_230_end_0, end_mask = var_230_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_230_cast_fp16")];
            tensor<int32, [4]> var_231_begin_0 = const()[name = tensor<string, []>("op_231_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_231_end_0 = const()[name = tensor<string, []>("op_231_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_231_end_mask_0 = const()[name = tensor<string, []>("op_231_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_231_cast_fp16 = slice_by_index(begin = var_231_begin_0, end = var_231_end_0, end_mask = var_231_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_231_cast_fp16")];
            tensor<int32, [4]> var_232_begin_0 = const()[name = tensor<string, []>("op_232_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_232_end_0 = const()[name = tensor<string, []>("op_232_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_232_end_mask_0 = const()[name = tensor<string, []>("op_232_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_232_cast_fp16 = slice_by_index(begin = var_232_begin_0, end = var_232_end_0, end_mask = var_232_end_mask_0, x = var_194_cast_fp16)[name = tensor<string, []>("op_232_cast_fp16")];
            tensor<int32, [4]> var_233_begin_0 = const()[name = tensor<string, []>("op_233_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_233_end_0 = const()[name = tensor<string, []>("op_233_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_233_end_mask_0 = const()[name = tensor<string, []>("op_233_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_233_cast_fp16 = slice_by_index(begin = var_233_begin_0, end = var_233_end_0, end_mask = var_233_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<int32, [4]> var_234_begin_0 = const()[name = tensor<string, []>("op_234_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_234_end_0 = const()[name = tensor<string, []>("op_234_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_234_end_mask_0 = const()[name = tensor<string, []>("op_234_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_234_cast_fp16 = slice_by_index(begin = var_234_begin_0, end = var_234_end_0, end_mask = var_234_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<int32, [4]> var_235_begin_0 = const()[name = tensor<string, []>("op_235_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_235_end_0 = const()[name = tensor<string, []>("op_235_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_235_end_mask_0 = const()[name = tensor<string, []>("op_235_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_235_cast_fp16 = slice_by_index(begin = var_235_begin_0, end = var_235_end_0, end_mask = var_235_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_235_cast_fp16")];
            tensor<int32, [4]> var_236_begin_0 = const()[name = tensor<string, []>("op_236_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_236_end_0 = const()[name = tensor<string, []>("op_236_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_236_end_mask_0 = const()[name = tensor<string, []>("op_236_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_236_cast_fp16 = slice_by_index(begin = var_236_begin_0, end = var_236_end_0, end_mask = var_236_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_236_cast_fp16")];
            tensor<int32, [4]> var_237_begin_0 = const()[name = tensor<string, []>("op_237_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_237_end_0 = const()[name = tensor<string, []>("op_237_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_237_end_mask_0 = const()[name = tensor<string, []>("op_237_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_237_cast_fp16 = slice_by_index(begin = var_237_begin_0, end = var_237_end_0, end_mask = var_237_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_237_cast_fp16")];
            tensor<int32, [4]> var_238_begin_0 = const()[name = tensor<string, []>("op_238_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_238_end_0 = const()[name = tensor<string, []>("op_238_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_238_end_mask_0 = const()[name = tensor<string, []>("op_238_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_238_cast_fp16 = slice_by_index(begin = var_238_begin_0, end = var_238_end_0, end_mask = var_238_end_mask_0, x = var_198_cast_fp16)[name = tensor<string, []>("op_238_cast_fp16")];
            tensor<int32, [4]> var_239_begin_0 = const()[name = tensor<string, []>("op_239_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_239_end_0 = const()[name = tensor<string, []>("op_239_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_239_end_mask_0 = const()[name = tensor<string, []>("op_239_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_239_cast_fp16 = slice_by_index(begin = var_239_begin_0, end = var_239_end_0, end_mask = var_239_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<int32, [4]> var_240_begin_0 = const()[name = tensor<string, []>("op_240_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_240_end_0 = const()[name = tensor<string, []>("op_240_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_240_end_mask_0 = const()[name = tensor<string, []>("op_240_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_240_cast_fp16 = slice_by_index(begin = var_240_begin_0, end = var_240_end_0, end_mask = var_240_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_240_cast_fp16")];
            tensor<int32, [4]> var_241_begin_0 = const()[name = tensor<string, []>("op_241_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_241_end_0 = const()[name = tensor<string, []>("op_241_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_241_end_mask_0 = const()[name = tensor<string, []>("op_241_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_241_cast_fp16 = slice_by_index(begin = var_241_begin_0, end = var_241_end_0, end_mask = var_241_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_241_cast_fp16")];
            tensor<int32, [4]> var_242_begin_0 = const()[name = tensor<string, []>("op_242_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_242_end_0 = const()[name = tensor<string, []>("op_242_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_242_end_mask_0 = const()[name = tensor<string, []>("op_242_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_242_cast_fp16 = slice_by_index(begin = var_242_begin_0, end = var_242_end_0, end_mask = var_242_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<int32, [4]> var_243_begin_0 = const()[name = tensor<string, []>("op_243_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_243_end_0 = const()[name = tensor<string, []>("op_243_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_243_end_mask_0 = const()[name = tensor<string, []>("op_243_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_243_cast_fp16 = slice_by_index(begin = var_243_begin_0, end = var_243_end_0, end_mask = var_243_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_243_cast_fp16")];
            tensor<int32, [4]> var_244_begin_0 = const()[name = tensor<string, []>("op_244_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_244_end_0 = const()[name = tensor<string, []>("op_244_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_244_end_mask_0 = const()[name = tensor<string, []>("op_244_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_244_cast_fp16 = slice_by_index(begin = var_244_begin_0, end = var_244_end_0, end_mask = var_244_end_mask_0, x = var_202_cast_fp16)[name = tensor<string, []>("op_244_cast_fp16")];
            tensor<int32, [4]> var_245_begin_0 = const()[name = tensor<string, []>("op_245_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_245_end_0 = const()[name = tensor<string, []>("op_245_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_245_end_mask_0 = const()[name = tensor<string, []>("op_245_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_245_cast_fp16 = slice_by_index(begin = var_245_begin_0, end = var_245_end_0, end_mask = var_245_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<int32, [4]> var_246_begin_0 = const()[name = tensor<string, []>("op_246_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_246_end_0 = const()[name = tensor<string, []>("op_246_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_246_end_mask_0 = const()[name = tensor<string, []>("op_246_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_246_cast_fp16 = slice_by_index(begin = var_246_begin_0, end = var_246_end_0, end_mask = var_246_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_246_cast_fp16")];
            tensor<int32, [4]> var_247_begin_0 = const()[name = tensor<string, []>("op_247_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_247_end_0 = const()[name = tensor<string, []>("op_247_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_247_end_mask_0 = const()[name = tensor<string, []>("op_247_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_247_cast_fp16 = slice_by_index(begin = var_247_begin_0, end = var_247_end_0, end_mask = var_247_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_247_cast_fp16")];
            tensor<int32, [4]> var_248_begin_0 = const()[name = tensor<string, []>("op_248_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_248_end_0 = const()[name = tensor<string, []>("op_248_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_248_end_mask_0 = const()[name = tensor<string, []>("op_248_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_248_cast_fp16 = slice_by_index(begin = var_248_begin_0, end = var_248_end_0, end_mask = var_248_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_248_cast_fp16")];
            tensor<int32, [4]> var_249_begin_0 = const()[name = tensor<string, []>("op_249_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_249_end_0 = const()[name = tensor<string, []>("op_249_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_249_end_mask_0 = const()[name = tensor<string, []>("op_249_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_249_cast_fp16 = slice_by_index(begin = var_249_begin_0, end = var_249_end_0, end_mask = var_249_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_249_cast_fp16")];
            tensor<int32, [4]> var_250_begin_0 = const()[name = tensor<string, []>("op_250_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_250_end_0 = const()[name = tensor<string, []>("op_250_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_250_end_mask_0 = const()[name = tensor<string, []>("op_250_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_250_cast_fp16 = slice_by_index(begin = var_250_begin_0, end = var_250_end_0, end_mask = var_250_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_250_cast_fp16")];
            tensor<int32, [4]> var_251_begin_0 = const()[name = tensor<string, []>("op_251_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_251_end_0 = const()[name = tensor<string, []>("op_251_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_251_end_mask_0 = const()[name = tensor<string, []>("op_251_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_251_cast_fp16 = slice_by_index(begin = var_251_begin_0, end = var_251_end_0, end_mask = var_251_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_251_cast_fp16")];
            tensor<int32, [4]> var_252_begin_0 = const()[name = tensor<string, []>("op_252_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_252_end_0 = const()[name = tensor<string, []>("op_252_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_252_end_mask_0 = const()[name = tensor<string, []>("op_252_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_252_cast_fp16 = slice_by_index(begin = var_252_begin_0, end = var_252_end_0, end_mask = var_252_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<int32, [4]> var_253_begin_0 = const()[name = tensor<string, []>("op_253_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_253_end_0 = const()[name = tensor<string, []>("op_253_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_253_end_mask_0 = const()[name = tensor<string, []>("op_253_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_253_cast_fp16 = slice_by_index(begin = var_253_begin_0, end = var_253_end_0, end_mask = var_253_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_253_cast_fp16")];
            tensor<int32, [4]> var_254_begin_0 = const()[name = tensor<string, []>("op_254_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_254_end_0 = const()[name = tensor<string, []>("op_254_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_254_end_mask_0 = const()[name = tensor<string, []>("op_254_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_254_cast_fp16 = slice_by_index(begin = var_254_begin_0, end = var_254_end_0, end_mask = var_254_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_254_cast_fp16")];
            tensor<int32, [4]> var_255_begin_0 = const()[name = tensor<string, []>("op_255_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_255_end_0 = const()[name = tensor<string, []>("op_255_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_255_end_mask_0 = const()[name = tensor<string, []>("op_255_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_255_cast_fp16 = slice_by_index(begin = var_255_begin_0, end = var_255_end_0, end_mask = var_255_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<int32, [4]> var_256_begin_0 = const()[name = tensor<string, []>("op_256_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_256_end_0 = const()[name = tensor<string, []>("op_256_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_256_end_mask_0 = const()[name = tensor<string, []>("op_256_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_256_cast_fp16 = slice_by_index(begin = var_256_begin_0, end = var_256_end_0, end_mask = var_256_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<int32, [4]> var_257_begin_0 = const()[name = tensor<string, []>("op_257_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_257_end_0 = const()[name = tensor<string, []>("op_257_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_257_end_mask_0 = const()[name = tensor<string, []>("op_257_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_257_cast_fp16 = slice_by_index(begin = var_257_begin_0, end = var_257_end_0, end_mask = var_257_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<int32, [4]> var_258_begin_0 = const()[name = tensor<string, []>("op_258_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_258_end_0 = const()[name = tensor<string, []>("op_258_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_258_end_mask_0 = const()[name = tensor<string, []>("op_258_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_258_cast_fp16 = slice_by_index(begin = var_258_begin_0, end = var_258_end_0, end_mask = var_258_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_258_cast_fp16")];
            tensor<int32, [4]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_259_cast_fp16 = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<int32, [4]> var_260_begin_0 = const()[name = tensor<string, []>("op_260_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_260_end_0 = const()[name = tensor<string, []>("op_260_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_260_end_mask_0 = const()[name = tensor<string, []>("op_260_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_260_cast_fp16 = slice_by_index(begin = var_260_begin_0, end = var_260_end_0, end_mask = var_260_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_260_cast_fp16")];
            tensor<int32, [4]> var_261_begin_0 = const()[name = tensor<string, []>("op_261_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_261_end_0 = const()[name = tensor<string, []>("op_261_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_261_end_mask_0 = const()[name = tensor<string, []>("op_261_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_261_cast_fp16 = slice_by_index(begin = var_261_begin_0, end = var_261_end_0, end_mask = var_261_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_261_cast_fp16")];
            tensor<int32, [4]> var_262_begin_0 = const()[name = tensor<string, []>("op_262_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_262_end_0 = const()[name = tensor<string, []>("op_262_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_262_end_mask_0 = const()[name = tensor<string, []>("op_262_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_262_cast_fp16 = slice_by_index(begin = var_262_begin_0, end = var_262_end_0, end_mask = var_262_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<int32, [4]> var_263_begin_0 = const()[name = tensor<string, []>("op_263_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_263_end_0 = const()[name = tensor<string, []>("op_263_end_0"), val = tensor<int32, [4]>([1, 64, 1, 256])];
            tensor<bool, [4]> var_263_end_mask_0 = const()[name = tensor<string, []>("op_263_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_263_cast_fp16 = slice_by_index(begin = var_263_begin_0, end = var_263_end_0, end_mask = var_263_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_263_cast_fp16")];
            tensor<int32, [4]> var_264_begin_0 = const()[name = tensor<string, []>("op_264_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_264_end_0 = const()[name = tensor<string, []>("op_264_end_0"), val = tensor<int32, [4]>([1, 64, 1, 512])];
            tensor<bool, [4]> var_264_end_mask_0 = const()[name = tensor<string, []>("op_264_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_264_cast_fp16 = slice_by_index(begin = var_264_begin_0, end = var_264_end_0, end_mask = var_264_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<int32, [4]> var_265_begin_0 = const()[name = tensor<string, []>("op_265_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_265_end_0 = const()[name = tensor<string, []>("op_265_end_0"), val = tensor<int32, [4]>([1, 64, 1, 768])];
            tensor<bool, [4]> var_265_end_mask_0 = const()[name = tensor<string, []>("op_265_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_265_cast_fp16 = slice_by_index(begin = var_265_begin_0, end = var_265_end_0, end_mask = var_265_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<int32, [4]> var_266_begin_0 = const()[name = tensor<string, []>("op_266_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 768])];
            tensor<int32, [4]> var_266_end_0 = const()[name = tensor<string, []>("op_266_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1024])];
            tensor<bool, [4]> var_266_end_mask_0 = const()[name = tensor<string, []>("op_266_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_266_cast_fp16 = slice_by_index(begin = var_266_begin_0, end = var_266_end_0, end_mask = var_266_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<int32, [4]> var_267_begin_0 = const()[name = tensor<string, []>("op_267_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_267_end_0 = const()[name = tensor<string, []>("op_267_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1280])];
            tensor<bool, [4]> var_267_end_mask_0 = const()[name = tensor<string, []>("op_267_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 256]> var_267_cast_fp16 = slice_by_index(begin = var_267_begin_0, end = var_267_end_0, end_mask = var_267_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_267_cast_fp16")];
            tensor<int32, [4]> var_268_begin_0 = const()[name = tensor<string, []>("op_268_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1280])];
            tensor<int32, [4]> var_268_end_0 = const()[name = tensor<string, []>("op_268_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1])];
            tensor<bool, [4]> var_268_end_mask_0 = const()[name = tensor<string, []>("op_268_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 64, 1, 220]> var_268_cast_fp16 = slice_by_index(begin = var_268_begin_0, end = var_268_end_0, end_mask = var_268_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_268_cast_fp16")];
            tensor<int32, [4]> k_1_perm_0 = const()[name = tensor<string, []>("k_1_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [4]> var_273_begin_0 = const()[name = tensor<string, []>("op_273_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_273_end_0 = const()[name = tensor<string, []>("op_273_end_0"), val = tensor<int32, [4]>([1, 1500, 1, 64])];
            tensor<bool, [4]> var_273_end_mask_0 = const()[name = tensor<string, []>("op_273_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1500, 1, 512]> k_1_cast_fp16 = transpose(perm = k_1_perm_0, x = key_1_cast_fp16)[name = tensor<string, []>("transpose_5")];
            tensor<fp16, [1, 1500, 1, 64]> var_273_cast_fp16 = slice_by_index(begin = var_273_begin_0, end = var_273_end_0, end_mask = var_273_end_mask_0, x = k_1_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
