program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp32, [1, 1500, 384]> encoder_output, tensor<int32, [1, 24]> input_ids) {
            tensor<int32, []> var_20_batch_dims_0 = const()[name = tensor<string, []>("op_20_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_20_validate_indices_0 = const()[name = tensor<string, []>("op_20_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51865, 384]> token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("token_embedding_weight_to_fp16"), val = tensor<fp16, [51865, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, []> greater_equal_0_y_0 = const()[name = tensor<string, []>("greater_equal_0_y_0"), val = tensor<int32, []>(0)];
            tensor<bool, [1, 24]> greater_equal_0 = greater_equal(x = input_ids, y = greater_equal_0_y_0)[name = tensor<string, []>("greater_equal_0")];
            tensor<int32, []> slice_by_index_0 = const()[name = tensor<string, []>("slice_by_index_0"), val = tensor<int32, []>(51865)];
            tensor<int32, [1, 24]> add_0 = add(x = input_ids, y = slice_by_index_0)[name = tensor<string, []>("add_0")];
            tensor<int32, [1, 24]> select_0 = select(a = input_ids, b = add_0, cond = greater_equal_0)[name = tensor<string, []>("select_0")];
            tensor<int32, []> var_20_cast_fp16_axis_0 = const()[name = tensor<string, []>("op_20_cast_fp16_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 24, 384]> var_20_cast_fp16 = gather(axis = var_20_cast_fp16_axis_0, batch_dims = var_20_batch_dims_0, indices = select_0, validate_indices = var_20_validate_indices_0, x = token_embedding_weight_to_fp16)[name = tensor<string, []>("op_20_cast_fp16")];
            tensor<fp16, [24, 384]> positional_embedding_to_fp16 = const()[name = tensor<string, []>("positional_embedding_to_fp16"), val = tensor<fp16, [24, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39832448)))];
            tensor<fp16, [1, 24, 384]> x_3_cast_fp16 = add(x = var_20_cast_fp16, y = positional_embedding_to_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [3]> var_50_perm_0 = const()[name = tensor<string, []>("op_50_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 384, 24]> var_50_cast_fp16 = transpose(perm = var_50_perm_0, x = x_3_cast_fp16)[name = tensor<string, []>("transpose_11")];
            tensor<fp16, [1, 384, 1, 24]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_50_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, [3]> var_55_perm_0 = const()[name = tensor<string, []>("op_55_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> encoder_output_to_fp16_dtype_0 = const()[name = tensor<string, []>("encoder_output_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1500, 384]> encoder_output_to_fp16 = cast(dtype = encoder_output_to_fp16_dtype_0, x = encoder_output)[name = tensor<string, []>("cast_28")];
            tensor<fp16, [1, 384, 1500]> var_55_cast_fp16 = transpose(perm = var_55_perm_0, x = encoder_output_to_fp16)[name = tensor<string, []>("transpose_10")];
            tensor<fp16, [1, 384, 1, 1500]> input_7_cast_fp16 = expand_dims(axes = input_7_axes_0, x = var_55_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, []> var_67 = const()[name = tensor<string, []>("op_67"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_1_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39850944)))];
            tensor<fp16, [384]> input_1_beta_0_to_fp16 = const()[name = tensor<string, []>("input_1_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39851776)))];
            tensor<fp16, []> var_85_to_fp16 = const()[name = tensor<string, []>("op_85_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 384, 1, 24]> input_1_cast_fp16 = layer_norm(axes = input_1_axes_0, beta = input_1_beta_0_to_fp16, epsilon = var_85_to_fp16, gamma = input_1_gamma_0_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_1_strides_0 = const()[name = tensor<string, []>("q_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_1_dilations_0 = const()[name = tensor<string, []>("q_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_1_groups_0 = const()[name = tensor<string, []>("q_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> var_121_weight_0_to_fp16 = const()[name = tensor<string, []>("op_121_weight_0_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39852608)))];
            tensor<fp16, [384]> var_121_bias_0_to_fp16 = const()[name = tensor<string, []>("op_121_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40147584)))];
            tensor<fp16, [1, 384, 1, 24]> var_121_cast_fp16 = conv(bias = var_121_bias_0_to_fp16, dilations = q_1_dilations_0, groups = q_1_groups_0, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = q_1_strides_0, weight = var_121_weight_0_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_121_cast_fp16")];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_1_strides_0 = const()[name = tensor<string, []>("k_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_1_dilations_0 = const()[name = tensor<string, []>("k_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_1_groups_0 = const()[name = tensor<string, []>("k_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40148416)))];
            tensor<fp16, [1, 384, 1, 24]> k_1_cast_fp16 = conv(dilations = k_1_dilations_0, groups = k_1_groups_0, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = k_1_strides_0, weight = blocks_0_attn_key_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<string, []> var_118_pad_type_0 = const()[name = tensor<string, []>("op_118_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_118_strides_0 = const()[name = tensor<string, []>("op_118_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_118_pad_0 = const()[name = tensor<string, []>("op_118_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_118_dilations_0 = const()[name = tensor<string, []>("op_118_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_118_groups_0 = const()[name = tensor<string, []>("op_118_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40443392)))];
            tensor<fp16, [384]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40738368)))];
            tensor<fp16, [1, 384, 1, 24]> var_118_cast_fp16 = conv(bias = blocks_0_attn_value_bias_to_fp16, dilations = var_118_dilations_0, groups = var_118_groups_0, pad = var_118_pad_0, pad_type = var_118_pad_type_0, strides = var_118_strides_0, weight = blocks_0_attn_value_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_118_cast_fp16")];
            tensor<int32, [6]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_122_axis_0 = const()[name = tensor<string, []>("op_122_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 24]> var_122_cast_fp16_0, tensor<fp16, [1, 64, 1, 24]> var_122_cast_fp16_1, tensor<fp16, [1, 64, 1, 24]> var_122_cast_fp16_2, tensor<fp16, [1, 64, 1, 24]> var_122_cast_fp16_3, tensor<fp16, [1, 64, 1, 24]> var_122_cast_fp16_4, tensor<fp16, [1, 64, 1, 24]> var_122_cast_fp16_5 = split(axis = var_122_axis_0, split_sizes = tile_0, x = var_121_cast_fp16)[name = tensor<string, []>("op_122_cast_fp16")];
            tensor<int32, [4]> var_129_perm_0 = const()[name = tensor<string, []>("op_129_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [6]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_130_axis_0 = const()[name = tensor<string, []>("op_130_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 24, 1, 384]> var_129_cast_fp16 = transpose(perm = var_129_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_9")];
            tensor<fp16, [1, 24, 1, 64]> var_130_cast_fp16_0, tensor<fp16, [1, 24, 1, 64]> var_130_cast_fp16_1, tensor<fp16, [1, 24, 1, 64]> var_130_cast_fp16_2, tensor<fp16, [1, 24, 1, 64]> var_130_cast_fp16_3, tensor<fp16, [1, 24, 1, 64]> var_130_cast_fp16_4, tensor<fp16, [1, 24, 1, 64]> var_130_cast_fp16_5 = split(axis = var_130_axis_0, split_sizes = tile_1, x = var_129_cast_fp16)[name = tensor<string, []>("op_130_cast_fp16")];
            tensor<int32, [6]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_137_axis_0 = const()[name = tensor<string, []>("op_137_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 24]> var_137_cast_fp16_0, tensor<fp16, [1, 64, 1, 24]> var_137_cast_fp16_1, tensor<fp16, [1, 64, 1, 24]> var_137_cast_fp16_2, tensor<fp16, [1, 64, 1, 24]> var_137_cast_fp16_3, tensor<fp16, [1, 64, 1, 24]> var_137_cast_fp16_4, tensor<fp16, [1, 64, 1, 24]> var_137_cast_fp16_5 = split(axis = var_137_axis_0, split_sizes = tile_2, x = var_118_cast_fp16)[name = tensor<string, []>("op_137_cast_fp16")];
            tensor<string, []> var_145_equation_0 = const()[name = tensor<string, []>("op_145_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_145_cast_fp16 = einsum(equation = var_145_equation_0, values = (var_130_cast_fp16_0, var_122_cast_fp16_0))[name = tensor<string, []>("op_145_cast_fp16")];
            tensor<string, []> var_147_equation_0 = const()[name = tensor<string, []>("op_147_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_147_cast_fp16 = einsum(equation = var_147_equation_0, values = (var_130_cast_fp16_1, var_122_cast_fp16_1))[name = tensor<string, []>("op_147_cast_fp16")];
            tensor<string, []> var_149_equation_0 = const()[name = tensor<string, []>("op_149_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_149_cast_fp16 = einsum(equation = var_149_equation_0, values = (var_130_cast_fp16_2, var_122_cast_fp16_2))[name = tensor<string, []>("op_149_cast_fp16")];
            tensor<string, []> var_151_equation_0 = const()[name = tensor<string, []>("op_151_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_151_cast_fp16 = einsum(equation = var_151_equation_0, values = (var_130_cast_fp16_3, var_122_cast_fp16_3))[name = tensor<string, []>("op_151_cast_fp16")];
            tensor<string, []> var_153_equation_0 = const()[name = tensor<string, []>("op_153_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_153_cast_fp16 = einsum(equation = var_153_equation_0, values = (var_130_cast_fp16_4, var_122_cast_fp16_4))[name = tensor<string, []>("op_153_cast_fp16")];
            tensor<string, []> var_155_equation_0 = const()[name = tensor<string, []>("op_155_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_155_cast_fp16 = einsum(equation = var_155_equation_0, values = (var_130_cast_fp16_5, var_122_cast_fp16_5))[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> mask_1_to_fp16 = const()[name = tensor<string, []>("mask_1_to_fp16"), val = tensor<fp16, [1, 24, 1, 24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40739200)))];
            tensor<fp16, [1, 24, 1, 24]> aw_1_cast_fp16 = add(x = var_145_cast_fp16, y = mask_1_to_fp16)[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> aw_3_cast_fp16 = add(x = var_147_cast_fp16, y = mask_1_to_fp16)[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> aw_5_cast_fp16 = add(x = var_149_cast_fp16, y = mask_1_to_fp16)[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> aw_7_cast_fp16 = add(x = var_151_cast_fp16, y = mask_1_to_fp16)[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> aw_9_cast_fp16 = add(x = var_153_cast_fp16, y = mask_1_to_fp16)[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> aw_11_cast_fp16 = add(x = var_155_cast_fp16, y = mask_1_to_fp16)[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> var_186_cast_fp16 = softmax(axis = var_67, x = aw_1_cast_fp16)[name = tensor<string, []>("op_186_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> var_187_cast_fp16 = softmax(axis = var_67, x = aw_3_cast_fp16)[name = tensor<string, []>("op_187_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> var_188_cast_fp16 = softmax(axis = var_67, x = aw_5_cast_fp16)[name = tensor<string, []>("op_188_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> var_189_cast_fp16 = softmax(axis = var_67, x = aw_7_cast_fp16)[name = tensor<string, []>("op_189_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> var_190_cast_fp16 = softmax(axis = var_67, x = aw_9_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<fp16, [1, 24, 1, 24]> var_191_cast_fp16 = softmax(axis = var_67, x = aw_11_cast_fp16)[name = tensor<string, []>("op_191_cast_fp16")];
            tensor<string, []> var_193_equation_0 = const()[name = tensor<string, []>("op_193_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_193_cast_fp16 = einsum(equation = var_193_equation_0, values = (var_137_cast_fp16_0, var_186_cast_fp16))[name = tensor<string, []>("op_193_cast_fp16")];
            tensor<string, []> var_195_equation_0 = const()[name = tensor<string, []>("op_195_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_195_cast_fp16 = einsum(equation = var_195_equation_0, values = (var_137_cast_fp16_1, var_187_cast_fp16))[name = tensor<string, []>("op_195_cast_fp16")];
            tensor<string, []> var_197_equation_0 = const()[name = tensor<string, []>("op_197_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_197_cast_fp16 = einsum(equation = var_197_equation_0, values = (var_137_cast_fp16_2, var_188_cast_fp16))[name = tensor<string, []>("op_197_cast_fp16")];
            tensor<string, []> var_199_equation_0 = const()[name = tensor<string, []>("op_199_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_199_cast_fp16 = einsum(equation = var_199_equation_0, values = (var_137_cast_fp16_3, var_189_cast_fp16))[name = tensor<string, []>("op_199_cast_fp16")];
            tensor<string, []> var_201_equation_0 = const()[name = tensor<string, []>("op_201_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_201_cast_fp16 = einsum(equation = var_201_equation_0, values = (var_137_cast_fp16_4, var_190_cast_fp16))[name = tensor<string, []>("op_201_cast_fp16")];
            tensor<string, []> var_203_equation_0 = const()[name = tensor<string, []>("op_203_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_203_cast_fp16 = einsum(equation = var_203_equation_0, values = (var_137_cast_fp16_5, var_191_cast_fp16))[name = tensor<string, []>("op_203_cast_fp16")];
            tensor<bool, []> input_3_interleave_0 = const()[name = tensor<string, []>("input_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 384, 1, 24]> input_3_cast_fp16 = concat(axis = var_67, interleave = input_3_interleave_0, values = (var_193_cast_fp16, var_195_cast_fp16, var_197_cast_fp16, var_199_cast_fp16, var_201_cast_fp16, var_203_cast_fp16))[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> var_212_pad_type_0 = const()[name = tensor<string, []>("op_212_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_212_strides_0 = const()[name = tensor<string, []>("op_212_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_212_pad_0 = const()[name = tensor<string, []>("op_212_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_212_dilations_0 = const()[name = tensor<string, []>("op_212_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_212_groups_0 = const()[name = tensor<string, []>("op_212_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40740416)))];
            tensor<fp16, [384]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41035392)))];
            tensor<fp16, [1, 384, 1, 24]> var_212_cast_fp16 = conv(bias = blocks_0_attn_out_bias_to_fp16, dilations = var_212_dilations_0, groups = var_212_groups_0, pad = var_212_pad_0, pad_type = var_212_pad_type_0, strides = var_212_strides_0, weight = blocks_0_attn_out_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_212_cast_fp16")];
            tensor<fp16, [1, 384, 1, 24]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = var_212_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> input_5_axes_0 = const()[name = tensor<string, []>("input_5_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_5_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41036224)))];
            tensor<fp16, [384]> input_5_beta_0_to_fp16 = const()[name = tensor<string, []>("input_5_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41037056)))];
            tensor<fp16, []> var_222_to_fp16 = const()[name = tensor<string, []>("op_222_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 384, 1, 24]> input_5_cast_fp16 = layer_norm(axes = input_5_axes_0, beta = input_5_beta_0_to_fp16, epsilon = var_222_to_fp16, gamma = input_5_gamma_0_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_3_strides_0 = const()[name = tensor<string, []>("q_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_3_dilations_0 = const()[name = tensor<string, []>("q_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_3_groups_0 = const()[name = tensor<string, []>("q_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> var_257_weight_0_to_fp16 = const()[name = tensor<string, []>("op_257_weight_0_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41037888)))];
            tensor<fp16, [384]> var_257_bias_0_to_fp16 = const()[name = tensor<string, []>("op_257_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41332864)))];
            tensor<fp16, [1, 384, 1, 24]> var_257_cast_fp16 = conv(bias = var_257_bias_0_to_fp16, dilations = q_3_dilations_0, groups = q_3_groups_0, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = q_3_strides_0, weight = var_257_weight_0_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_3_strides_0 = const()[name = tensor<string, []>("k_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_3_dilations_0 = const()[name = tensor<string, []>("k_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_3_groups_0 = const()[name = tensor<string, []>("k_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_0_cross_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_key_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41333696)))];
            tensor<fp16, [1, 384, 1, 1500]> k_3_cast_fp16 = conv(dilations = k_3_dilations_0, groups = k_3_groups_0, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = k_3_strides_0, weight = blocks_0_cross_attn_key_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<string, []> var_255_pad_type_0 = const()[name = tensor<string, []>("op_255_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_255_strides_0 = const()[name = tensor<string, []>("op_255_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_255_pad_0 = const()[name = tensor<string, []>("op_255_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_255_dilations_0 = const()[name = tensor<string, []>("op_255_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_255_groups_0 = const()[name = tensor<string, []>("op_255_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_0_cross_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_value_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41628672)))];
            tensor<fp16, [384]> blocks_0_cross_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41923648)))];
            tensor<fp16, [1, 384, 1, 1500]> var_255_cast_fp16 = conv(bias = blocks_0_cross_attn_value_bias_to_fp16, dilations = var_255_dilations_0, groups = var_255_groups_0, pad = var_255_pad_0, pad_type = var_255_pad_type_0, strides = var_255_strides_0, weight = blocks_0_cross_attn_value_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<int32, [6]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_258_axis_0 = const()[name = tensor<string, []>("op_258_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 24]> var_258_cast_fp16_0, tensor<fp16, [1, 64, 1, 24]> var_258_cast_fp16_1, tensor<fp16, [1, 64, 1, 24]> var_258_cast_fp16_2, tensor<fp16, [1, 64, 1, 24]> var_258_cast_fp16_3, tensor<fp16, [1, 64, 1, 24]> var_258_cast_fp16_4, tensor<fp16, [1, 64, 1, 24]> var_258_cast_fp16_5 = split(axis = var_258_axis_0, split_sizes = tile_3, x = var_257_cast_fp16)[name = tensor<string, []>("op_258_cast_fp16")];
            tensor<int32, [4]> var_265_perm_0 = const()[name = tensor<string, []>("op_265_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [6]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_266_axis_0 = const()[name = tensor<string, []>("op_266_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 384]> var_265_cast_fp16 = transpose(perm = var_265_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_8")];
            tensor<fp16, [1, 1500, 1, 64]> var_266_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_266_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_266_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_266_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_266_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_266_cast_fp16_5 = split(axis = var_266_axis_0, split_sizes = tile_4, x = var_265_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<int32, [6]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_273_axis_0 = const()[name = tensor<string, []>("op_273_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_273_cast_fp16_5 = split(axis = var_273_axis_0, split_sizes = tile_5, x = var_255_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<string, []> aw_13_equation_0 = const()[name = tensor<string, []>("aw_13_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 24]> aw_13_cast_fp16 = einsum(equation = aw_13_equation_0, values = (var_266_cast_fp16_0, var_258_cast_fp16_0))[name = tensor<string, []>("aw_13_cast_fp16")];
            tensor<string, []> aw_15_equation_0 = const()[name = tensor<string, []>("aw_15_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 24]> aw_15_cast_fp16 = einsum(equation = aw_15_equation_0, values = (var_266_cast_fp16_1, var_258_cast_fp16_1))[name = tensor<string, []>("aw_15_cast_fp16")];
            tensor<string, []> aw_17_equation_0 = const()[name = tensor<string, []>("aw_17_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 24]> aw_17_cast_fp16 = einsum(equation = aw_17_equation_0, values = (var_266_cast_fp16_2, var_258_cast_fp16_2))[name = tensor<string, []>("aw_17_cast_fp16")];
            tensor<string, []> aw_19_equation_0 = const()[name = tensor<string, []>("aw_19_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 24]> aw_19_cast_fp16 = einsum(equation = aw_19_equation_0, values = (var_266_cast_fp16_3, var_258_cast_fp16_3))[name = tensor<string, []>("aw_19_cast_fp16")];
            tensor<string, []> aw_21_equation_0 = const()[name = tensor<string, []>("aw_21_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 24]> aw_21_cast_fp16 = einsum(equation = aw_21_equation_0, values = (var_266_cast_fp16_4, var_258_cast_fp16_4))[name = tensor<string, []>("aw_21_cast_fp16")];
            tensor<string, []> aw_23_equation_0 = const()[name = tensor<string, []>("aw_23_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 24]> aw_23_cast_fp16 = einsum(equation = aw_23_equation_0, values = (var_266_cast_fp16_5, var_258_cast_fp16_5))[name = tensor<string, []>("aw_23_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 24]> var_292_cast_fp16 = softmax(axis = var_67, x = aw_13_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 24]> var_293_cast_fp16 = softmax(axis = var_67, x = aw_15_cast_fp16)[name = tensor<string, []>("op_293_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 24]> var_294_cast_fp16 = softmax(axis = var_67, x = aw_17_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 24]> var_295_cast_fp16 = softmax(axis = var_67, x = aw_19_cast_fp16)[name = tensor<string, []>("op_295_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 24]> var_296_cast_fp16 = softmax(axis = var_67, x = aw_21_cast_fp16)[name = tensor<string, []>("op_296_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 24]> var_297_cast_fp16 = softmax(axis = var_67, x = aw_23_cast_fp16)[name = tensor<string, []>("op_297_cast_fp16")];
            tensor<string, []> var_299_equation_0 = const()[name = tensor<string, []>("op_299_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_299_cast_fp16 = einsum(equation = var_299_equation_0, values = (var_273_cast_fp16_0, var_292_cast_fp16))[name = tensor<string, []>("op_299_cast_fp16")];
            tensor<string, []> var_301_equation_0 = const()[name = tensor<string, []>("op_301_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_301_cast_fp16 = einsum(equation = var_301_equation_0, values = (var_273_cast_fp16_1, var_293_cast_fp16))[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<string, []> var_303_equation_0 = const()[name = tensor<string, []>("op_303_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_303_cast_fp16 = einsum(equation = var_303_equation_0, values = (var_273_cast_fp16_2, var_294_cast_fp16))[name = tensor<string, []>("op_303_cast_fp16")];
            tensor<string, []> var_305_equation_0 = const()[name = tensor<string, []>("op_305_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_305_cast_fp16 = einsum(equation = var_305_equation_0, values = (var_273_cast_fp16_3, var_295_cast_fp16))[name = tensor<string, []>("op_305_cast_fp16")];
            tensor<string, []> var_307_equation_0 = const()[name = tensor<string, []>("op_307_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_307_cast_fp16 = einsum(equation = var_307_equation_0, values = (var_273_cast_fp16_4, var_296_cast_fp16))[name = tensor<string, []>("op_307_cast_fp16")];
            tensor<string, []> var_309_equation_0 = const()[name = tensor<string, []>("op_309_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 24]> var_309_cast_fp16 = einsum(equation = var_309_equation_0, values = (var_273_cast_fp16_5, var_297_cast_fp16))[name = tensor<string, []>("op_309_cast_fp16")];
            tensor<bool, []> input_9_interleave_0 = const()[name = tensor<string, []>("input_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 384, 1, 24]> input_9_cast_fp16 = concat(axis = var_67, interleave = input_9_interleave_0, values = (var_299_cast_fp16, var_301_cast_fp16, var_303_cast_fp16, var_305_cast_fp16, var_307_cast_fp16, var_309_cast_fp16))[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> var_318_pad_type_0 = const()[name = tensor<string, []>("op_318_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_318_strides_0 = const()[name = tensor<string, []>("op_318_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_318_pad_0 = const()[name = tensor<string, []>("op_318_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_318_dilations_0 = const()[name = tensor<string, []>("op_318_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_318_groups_0 = const()[name = tensor<string, []>("op_318_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_0_cross_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_out_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41924480)))];
            tensor<fp16, [384]> blocks_0_cross_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_out_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42219456)))];
            tensor<fp16, [1, 384, 1, 24]> var_318_cast_fp16 = conv(bias = blocks_0_cross_attn_out_bias_to_fp16, dilations = var_318_dilations_0, groups = var_318_groups_0, pad = var_318_pad_0, pad_type = var_318_pad_type_0, strides = var_318_strides_0, weight = blocks_0_cross_attn_out_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("op_318_cast_fp16")];
            tensor<fp16, [1, 384, 1, 24]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = var_318_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_11_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_11_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42220288)))];
            tensor<fp16, [384]> input_11_beta_0_to_fp16 = const()[name = tensor<string, []>("input_11_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42221120)))];
            tensor<fp16, []> var_328_to_fp16 = const()[name = tensor<string, []>("op_328_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 384, 1, 24]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = input_11_beta_0_to_fp16, epsilon = var_328_to_fp16, gamma = input_11_gamma_0_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1536, 384, 1, 1]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [1536, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42221952)))];
            tensor<fp16, [1536]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43401664)))];
            tensor<fp16, [1, 1536, 1, 24]> input_13_cast_fp16 = conv(bias = blocks_0_mlp_0_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = blocks_0_mlp_0_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1536, 1, 24]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> var_354_pad_type_0 = const()[name = tensor<string, []>("op_354_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_354_strides_0 = const()[name = tensor<string, []>("op_354_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_354_pad_0 = const()[name = tensor<string, []>("op_354_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_354_dilations_0 = const()[name = tensor<string, []>("op_354_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_354_groups_0 = const()[name = tensor<string, []>("op_354_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 1536, 1, 1]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [384, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43404800)))];
            tensor<fp16, [384]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44584512)))];
            tensor<fp16, [1, 384, 1, 24]> var_354_cast_fp16 = conv(bias = blocks_0_mlp_2_bias_to_fp16, dilations = var_354_dilations_0, groups = var_354_groups_0, pad = var_354_pad_0, pad_type = var_354_pad_type_0, strides = var_354_strides_0, weight = blocks_0_mlp_2_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_354_cast_fp16")];
            tensor<fp16, [1, 384, 1, 24]> inputs_7_cast_fp16 = add(x = inputs_5_cast_fp16, y = var_354_cast_fp16)[name = tensor<string, []>("inputs_7_cast_fp16")];
            tensor<int32, []> var_365 = const()[name = tensor<string, []>("op_365"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_17_axes_0 = const()[name = tensor<string, []>("input_17_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [384]> input_17_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_17_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44585344)))];
            tensor<fp16, [384]> input_17_beta_0_to_fp16 = const()[name = tensor<string, []>("input_17_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44586176)))];
            tensor<fp16, []> var_383_to_fp16 = const()[name = tensor<string, []>("op_383_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 384, 1, 24]> input_17_cast_fp16 = layer_norm(axes = input_17_axes_0, beta = input_17_beta_0_to_fp16, epsilon = var_383_to_fp16, gamma = input_17_gamma_0_to_fp16, x = inputs_7_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> q_5_pad_type_0 = const()[name = tensor<string, []>("q_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_5_strides_0 = const()[name = tensor<string, []>("q_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_5_pad_0 = const()[name = tensor<string, []>("q_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_5_dilations_0 = const()[name = tensor<string, []>("q_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_5_groups_0 = const()[name = tensor<string, []>("q_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> var_419_weight_0_to_fp16 = const()[name = tensor<string, []>("op_419_weight_0_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44587008)))];
            tensor<fp16, [384]> var_419_bias_0_to_fp16 = const()[name = tensor<string, []>("op_419_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44881984)))];
            tensor<fp16, [1, 384, 1, 24]> var_419_cast_fp16 = conv(bias = var_419_bias_0_to_fp16, dilations = q_5_dilations_0, groups = q_5_groups_0, pad = q_5_pad_0, pad_type = q_5_pad_type_0, strides = q_5_strides_0, weight = var_419_weight_0_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("op_419_cast_fp16")];
            tensor<string, []> k_5_pad_type_0 = const()[name = tensor<string, []>("k_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_5_strides_0 = const()[name = tensor<string, []>("k_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_5_pad_0 = const()[name = tensor<string, []>("k_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_5_dilations_0 = const()[name = tensor<string, []>("k_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_5_groups_0 = const()[name = tensor<string, []>("k_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44882816)))];
            tensor<fp16, [1, 384, 1, 24]> k_5_cast_fp16 = conv(dilations = k_5_dilations_0, groups = k_5_groups_0, pad = k_5_pad_0, pad_type = k_5_pad_type_0, strides = k_5_strides_0, weight = blocks_1_attn_key_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("k_5_cast_fp16")];
            tensor<string, []> var_416_pad_type_0 = const()[name = tensor<string, []>("op_416_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_416_strides_0 = const()[name = tensor<string, []>("op_416_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_416_pad_0 = const()[name = tensor<string, []>("op_416_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_416_dilations_0 = const()[name = tensor<string, []>("op_416_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_416_groups_0 = const()[name = tensor<string, []>("op_416_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 384, 1, 1]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45177792)))];
            tensor<fp16, [384]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45472768)))];
            tensor<fp16, [1, 384, 1, 24]> var_416_cast_fp16 = conv(bias = blocks_1_attn_value_bias_to_fp16, dilations = var_416_dilations_0, groups = var_416_groups_0, pad = var_416_pad_0, pad_type = var_416_pad_type_0, strides = var_416_strides_0, weight = blocks_1_attn_value_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("op_416_cast_fp16")];
            tensor<int32, [6]> tile_6 = const()[name = tensor<string, []>("tile_6"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_420_axis_0 = const()[name = tensor<string, []>("op_420_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 24]> var_420_cast_fp16_0, tensor<fp16, [1, 64, 1, 24]> var_420_cast_fp16_1, tensor<fp16, [1, 64, 1, 24]> var_420_cast_fp16_2, tensor<fp16, [1, 64, 1, 24]> var_420_cast_fp16_3, tensor<fp16, [1, 64, 1, 24]> var_420_cast_fp16_4, tensor<fp16, [1, 64, 1, 24]> var_420_cast_fp16_5 = split(axis = var_420_axis_0, split_sizes = tile_6, x = var_419_cast_fp16)[name = tensor<string, []>("op_420_cast_fp16")];
            tensor<int32, [4]> var_427_perm_0 = const()[name = tensor<string, []>("op_427_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [6]> tile_7 = const()[name = tensor<string, []>("tile_7"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_428_axis_0 = const()[name = tensor<string, []>("op_428_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 24, 1, 384]> var_427_cast_fp16 = transpose(perm = var_427_perm_0, x = k_5_cast_fp16)[name = tensor<string, []>("transpose_7")];
            tensor<fp16, [1, 24, 1, 64]> var_428_cast_fp16_0, tensor<fp16, [1, 24, 1, 64]> var_428_cast_fp16_1, tensor<fp16, [1, 24, 1, 64]> var_428_cast_fp16_2, tensor<fp16, [1, 24, 1, 64]> var_428_cast_fp16_3, tensor<fp16, [1, 24, 1, 64]> var_428_cast_fp16_4, tensor<fp16, [1, 24, 1, 64]> var_428_cast_fp16_5 = split(axis = var_428_axis_0, split_sizes = tile_7, x = var_427_cast_fp16)[name = tensor<string, []>("op_428_cast_fp16")];
            tensor<int32, [6]> tile_8 = const()[name = tensor<string, []>("tile_8"), val = tensor<int32, [6]>([64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_435_axis_0 = const()[name = tensor<string, []>("op_435_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 24]> var_435_cast_fp16_0, tensor<fp16, [1, 64, 1, 24]> var_435_cast_fp16_1, tensor<fp16, [1, 64, 1, 24]> var_435_cast_fp16_2, tensor<fp16, [1, 64, 1, 24]> var_435_cast_fp16_3, tensor<fp16, [1, 64, 1, 24]> var_435_cast_fp16_4, tensor<fp16, [1, 64, 1, 24]> var_435_cast_fp16_5 = split(axis = var_435_axis_0, split_sizes = tile_8, x = var_416_cast_fp16)[name = tensor<string, []>("op_435_cast_fp16")];
            tensor<string, []> var_443_equation_0 = const()[name = tensor<string, []>("op_443_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_443_cast_fp16 = einsum(equation = var_443_equation_0, values = (var_428_cast_fp16_0, var_420_cast_fp16_0))[name = tensor<string, []>("op_443_cast_fp16")];
            tensor<string, []> var_445_equation_0 = const()[name = tensor<string, []>("op_445_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_445_cast_fp16 = einsum(equation = var_445_equation_0, values = (var_428_cast_fp16_1, var_420_cast_fp16_1))[name = tensor<string, []>("op_445_cast_fp16")];
            tensor<string, []> var_447_equation_0 = const()[name = tensor<string, []>("op_447_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 24, 1, 24]> var_447_cast_fp16 = einsum(equation = var_447_equation_0, values = (var_428_cast_fp16_2, var_420_cast_fp16_2))[name = tensor<string, []>("op_447_cast_fp16")];
            tensor<string, []> var_449_equation_0 = const()[name = tensor<string, []>("op_449_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
