program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0b1"}})]
{
    func main<ios17>(tensor<fp16, [1, 1500, 384]> encoder_output, tensor<int32, [1, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"input_ids", [1, 1]}}), ("RangeDims", {{"input_ids", [[1, 1], [1, 20]]}})))] {
            tensor<int32, []> var_16 = const()[name = tensor<string, []>("op_16"), val = tensor<int32, []>(6)];
            tensor<int32, []> var_22 = const()[name = tensor<string, []>("op_22"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_23 = const()[name = tensor<string, []>("op_23"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_36_shape = shape(x = input_ids)[name = tensor<string, []>("op_36_shape")];
            tensor<int32, []> gather_0 = const()[name = tensor<string, []>("gather_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_1_axis_0 = const()[name = tensor<string, []>("gather_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_1_batch_dims_0 = const()[name = tensor<string, []>("gather_1_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_1_validate_indices_0 = const()[name = tensor<string, []>("gather_1_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_36_shape_to_int16_dtype_0 = const()[name = tensor<string, []>("op_36_shape_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<uint16, []> gather_1_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_1_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<int16, [2]> var_36_shape_to_int16 = cast(dtype = var_36_shape_to_int16_dtype_0, x = var_36_shape)[name = tensor<string, []>("cast_100")];
            tensor<int16, []> gather_1_cast_uint16 = gather(axis = gather_1_axis_0, batch_dims = gather_1_batch_dims_0, indices = gather_1_indices_0_to_uint16, validate_indices = gather_1_validate_indices_0, x = var_36_shape_to_int16)[name = tensor<string, []>("gather_1_cast_uint16")];
            tensor<string, []> gather_1_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_1_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> inputs_embeds_validate_indices_0 = const()[name = tensor<string, []>("inputs_embeds_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51865, 384]> decoder_embed_tokens_weight_to_fp16 = const()[name = tensor<string, []>("decoder_embed_tokens_weight_to_fp16"), val = tensor<fp16, [51865, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, []> greater_equal_0_y_0 = const()[name = tensor<string, []>("greater_equal_0_y_0"), val = tensor<int32, []>(0)];
            tensor<bool, [1, ?]> greater_equal_0 = greater_equal(x = input_ids, y = greater_equal_0_y_0)[name = tensor<string, []>("greater_equal_0")];
            tensor<int32, []> slice_by_index_0 = const()[name = tensor<string, []>("slice_by_index_0"), val = tensor<int32, []>(51865)];
            tensor<int32, [1, ?]> add_0 = add(x = input_ids, y = slice_by_index_0)[name = tensor<string, []>("add_0")];
            tensor<int32, [1, ?]> select_0 = select(a = input_ids, b = add_0, cond = greater_equal_0)[name = tensor<string, []>("select_0")];
            tensor<int32, []> inputs_embeds_cast_fp16_axis_0 = const()[name = tensor<string, []>("inputs_embeds_cast_fp16_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, ?, 384]> inputs_embeds_cast_fp16 = gather(axis = inputs_embeds_cast_fp16_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = select_0, validate_indices = inputs_embeds_validate_indices_0, x = decoder_embed_tokens_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast_fp16")];
            tensor<int32, []> gather_1_cast_uint16_to_int32 = cast(dtype = gather_1_cast_uint16_to_int32_dtype_0, x = gather_1_cast_uint16)[name = tensor<string, []>("cast_99")];
            tensor<int32, []> past_key_values_length = sub(x = gather_1_cast_uint16_to_int32, y = gather_1_cast_uint16_to_int32)[name = tensor<string, []>("past_key_values_length")];
            tensor<int32, []> concat_1_axis_0 = const()[name = tensor<string, []>("concat_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_1_interleave_0 = const()[name = tensor<string, []>("concat_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [2]> concat_1 = concat(axis = concat_1_axis_0, interleave = concat_1_interleave_0, values = (gather_1_cast_uint16_to_int32, gather_1_cast_uint16_to_int32))[name = tensor<string, []>("concat_1")];
            tensor<fp16, []> mask_1_value_0_to_fp16 = const()[name = tensor<string, []>("mask_1_value_0_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [?, ?]> mask_1_cast_fp16 = fill(shape = concat_1, value = mask_1_value_0_to_fp16)[name = tensor<string, []>("mask_1_cast_fp16")];
            tensor<int32, [2]> var_48_shape_cast_fp16 = shape(x = mask_1_cast_fp16)[name = tensor<string, []>("op_48_shape_cast_fp16")];
            tensor<int32, []> gather_2_batch_dims_0 = const()[name = tensor<string, []>("gather_2_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_2_validate_indices_0 = const()[name = tensor<string, []>("gather_2_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_48_shape_cast_fp16_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_48_shape_cast_fp16_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<int32, []> gather_2_cast_uint16_axis_0 = const()[name = tensor<string, []>("gather_2_cast_uint16_axis_0"), val = tensor<int32, []>(0)];
            tensor<uint16, []> select_1_to_uint16 = const()[name = tensor<string, []>("select_1_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [2]> var_48_shape_cast_fp16_to_uint16 = cast(dtype = var_48_shape_cast_fp16_to_uint16_dtype_0, x = var_48_shape_cast_fp16)[name = tensor<string, []>("cast_98")];
            tensor<uint16, []> gather_2_cast_uint16_cast_uint16 = gather(axis = gather_2_cast_uint16_axis_0, batch_dims = gather_2_batch_dims_0, indices = select_1_to_uint16, validate_indices = gather_2_validate_indices_0, x = var_48_shape_cast_fp16_to_uint16)[name = tensor<string, []>("gather_2_cast_uint16_cast_uint16")];
            tensor<string, []> gather_2_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_2_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> const_0 = const()[name = tensor<string, []>("const_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> const_1 = const()[name = tensor<string, []>("const_1"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_2_cast_uint16_to_int32 = cast(dtype = gather_2_cast_uint16_to_int32_dtype_0, x = gather_2_cast_uint16_cast_uint16)[name = tensor<string, []>("cast_97")];
            tensor<int32, [?]> mask_cond = range_1d(end = gather_2_cast_uint16_to_int32, start = const_0, step = const_1)[name = tensor<string, []>("mask_cond")];
            tensor<int32, []> var_50 = const()[name = tensor<string, []>("op_50"), val = tensor<int32, []>(1)];
            tensor<int32, [?]> var_51 = add(x = mask_cond, y = var_50)[name = tensor<string, []>("op_51")];
            tensor<int32, [2]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [2]>([-1, 1])];
            tensor<int32, [?, 1]> var_54 = reshape(shape = concat_2x, x = var_51)[name = tensor<string, []>("op_54")];
            tensor<bool, [?, ?]> var_55 = less(x = mask_cond, y = var_54)[name = tensor<string, []>("op_55")];
            tensor<fp16, []> cast_4_to_fp16 = const()[name = tensor<string, []>("cast_4_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [?, ?]> mask_3_cast_fp16 = select(a = cast_4_to_fp16, b = mask_1_cast_fp16, cond = var_55)[name = tensor<string, []>("mask_3_cast_fp16")];
            tensor<int32, [1]> var_58_axes_0 = const()[name = tensor<string, []>("op_58_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, ?, ?]> var_58_cast_fp16 = expand_dims(axes = var_58_axes_0, x = mask_3_cast_fp16)[name = tensor<string, []>("op_58_cast_fp16")];
            tensor<int32, [1]> var_59_axes_0 = const()[name = tensor<string, []>("op_59_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, ?, ?]> var_59_cast_fp16 = expand_dims(axes = var_59_axes_0, x = var_58_cast_fp16)[name = tensor<string, []>("op_59_cast_fp16")];
            tensor<int32, []> var_62 = add(x = gather_1_cast_uint16_to_int32, y = past_key_values_length)[name = tensor<string, []>("op_62")];
            tensor<int32, []> concat_3_axis_0 = const()[name = tensor<string, []>("concat_3_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_3_interleave_0 = const()[name = tensor<string, []>("concat_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_3 = concat(axis = concat_3_axis_0, interleave = concat_3_interleave_0, values = (gather_0, var_23, gather_1_cast_uint16_to_int32, var_62))[name = tensor<string, []>("concat_3")];
            tensor<int32, [4]> shape_0_cast_fp16 = shape(x = var_59_cast_fp16)[name = tensor<string, []>("shape_0_cast_fp16")];
            tensor<int32, [4]> real_div_0 = real_div(x = concat_3, y = shape_0_cast_fp16)[name = tensor<string, []>("real_div_0")];
            tensor<fp16, [?, ?, ?, ?]> attention_mask_cast_fp16 = tile(reps = real_div_0, x = var_59_cast_fp16)[name = tensor<string, []>("attention_mask_cast_fp16")];
            tensor<int32, []> concat_4_values1_0 = const()[name = tensor<string, []>("concat_4_values1_0"), val = tensor<int32, []>(384)];
            tensor<int32, []> concat_4_axis_0 = const()[name = tensor<string, []>("concat_4_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_4_interleave_0 = const()[name = tensor<string, []>("concat_4_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [2]> concat_4 = concat(axis = concat_4_axis_0, interleave = concat_4_interleave_0, values = (gather_1_cast_uint16_to_int32, concat_4_values1_0))[name = tensor<string, []>("concat_4")];
            tensor<int32, [2]> positions_begin_0 = const()[name = tensor<string, []>("positions_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> positions_end_mask_0 = const()[name = tensor<string, []>("positions_end_mask_0"), val = tensor<bool, [2]>([false, true])];
            tensor<fp16, [448, 384]> decoder_embed_positions_weight_to_fp16 = const()[name = tensor<string, []>("decoder_embed_positions_weight_to_fp16"), val = tensor<fp16, [448, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39832448)))];
            tensor<fp16, [?, 384]> positions_cast_fp16 = slice_by_index(begin = positions_begin_0, end = concat_4, end_mask = positions_end_mask_0, x = decoder_embed_positions_weight_to_fp16)[name = tensor<string, []>("positions_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_3_cast_fp16 = add(x = inputs_embeds_cast_fp16, y = positions_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40176576)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40177408)))];
            tensor<fp16, []> var_8_to_fp16 = const()[name = tensor<string, []>("op_8_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 384]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = decoder_layers_0_self_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_0_self_attn_layer_norm_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [3]> var_90_shape_cast_fp16 = shape(x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_90_shape_cast_fp16")];
            tensor<int32, []> gather_5 = const()[name = tensor<string, []>("gather_5"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_6_axis_0 = const()[name = tensor<string, []>("gather_6_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_6_batch_dims_0 = const()[name = tensor<string, []>("gather_6_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_6_validate_indices_0 = const()[name = tensor<string, []>("gather_6_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_90_shape_cast_fp16_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_90_shape_cast_fp16_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, []> gather_6_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_6_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [3]> var_90_shape_cast_fp16_to_uint16 = cast(dtype = var_90_shape_cast_fp16_to_uint16_dtype_0, x = var_90_shape_cast_fp16)[name = tensor<string, []>("cast_96")];
            tensor<uint16, []> gather_6_cast_uint16 = gather(axis = gather_6_axis_0, batch_dims = gather_6_batch_dims_0, indices = gather_6_indices_0_to_uint16, validate_indices = gather_6_validate_indices_0, x = var_90_shape_cast_fp16_to_uint16)[name = tensor<string, []>("gather_6_cast_uint16")];
            tensor<string, []> gather_6_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_6_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40178240)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40473216)))];
            tensor<fp16, [1, ?, 384]> linear_0_cast_fp16 = linear(bias = decoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, []> var_96_to_fp16 = const()[name = tensor<string, []>("op_96_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_5_cast_fp16 = mul(x = linear_0_cast_fp16, y = var_96_to_fp16)[name = tensor<string, []>("tensor_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40474048)))];
            tensor<fp16, [384]> linear_1_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_1_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40769024)))];
            tensor<fp16, [1, ?, 384]> linear_1_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> var_100 = const()[name = tensor<string, []>("op_100"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_101_cast_fp16 = reshape(shape = var_100, x = linear_1_cast_fp16)[name = tensor<string, []>("op_101_cast_fp16")];
            tensor<int32, [4]> var_102_perm_0 = const()[name = tensor<string, []>("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40769856)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41064832)))];
            tensor<fp16, [1, ?, 384]> linear_2_cast_fp16 = linear(bias = decoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_107 = const()[name = tensor<string, []>("op_107"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_108_cast_fp16 = reshape(shape = var_107, x = linear_2_cast_fp16)[name = tensor<string, []>("op_108_cast_fp16")];
            tensor<int32, [4]> var_109_perm_0 = const()[name = tensor<string, []>("op_109_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> concat_5x = const()[name = tensor<string, []>("concat_5x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_117_cast_fp16 = reshape(shape = concat_5x, x = tensor_5_cast_fp16)[name = tensor<string, []>("op_117_cast_fp16")];
            tensor<int32, [4]> var_118_perm_0 = const()[name = tensor<string, []>("op_118_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_118_cast_fp16 = transpose(perm = var_118_perm_0, x = var_117_cast_fp16)[name = tensor<string, []>("transpose_29")];
            tensor<fp16, [6, ?, 64]> query_states_1_cast_fp16 = reshape(shape = var_120, x = var_118_cast_fp16)[name = tensor<string, []>("query_states_1_cast_fp16")];
            tensor<int32, [3]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_102_cast_fp16 = transpose(perm = var_102_perm_0, x = var_101_cast_fp16)[name = tensor<string, []>("transpose_31")];
            tensor<fp16, [6, ?, 64]> key_states_3_cast_fp16 = reshape(shape = var_122, x = var_102_cast_fp16)[name = tensor<string, []>("key_states_3_cast_fp16")];
            tensor<int32, [3]> var_124 = const()[name = tensor<string, []>("op_124"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_109_cast_fp16 = transpose(perm = var_109_perm_0, x = var_108_cast_fp16)[name = tensor<string, []>("transpose_30")];
            tensor<fp16, [6, ?, 64]> value_states_3_cast_fp16 = reshape(shape = var_124, x = var_109_cast_fp16)[name = tensor<string, []>("value_states_3_cast_fp16")];
            tensor<int32, [3]> var_126_shape_cast_fp16 = shape(x = key_states_3_cast_fp16)[name = tensor<string, []>("op_126_shape_cast_fp16")];
            tensor<int32, []> gather_7_axis_0 = const()[name = tensor<string, []>("gather_7_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_7_batch_dims_0 = const()[name = tensor<string, []>("gather_7_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_7_validate_indices_0 = const()[name = tensor<string, []>("gather_7_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_126_shape_cast_fp16_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_126_shape_cast_fp16_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, []> gather_7_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_7_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [3]> var_126_shape_cast_fp16_to_uint16 = cast(dtype = var_126_shape_cast_fp16_to_uint16_dtype_0, x = var_126_shape_cast_fp16)[name = tensor<string, []>("cast_94")];
            tensor<uint16, []> gather_7_cast_uint16 = gather(axis = gather_7_axis_0, batch_dims = gather_7_batch_dims_0, indices = gather_7_indices_0_to_uint16, validate_indices = gather_7_validate_indices_0, x = var_126_shape_cast_fp16_to_uint16)[name = tensor<string, []>("gather_7_cast_uint16")];
            tensor<string, []> gather_7_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_7_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<bool, []> attn_weights_1_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, ?, ?]> attn_weights_1_cast_fp16 = matmul(transpose_x = attn_weights_1_transpose_x_1, transpose_y = attn_weights_1_transpose_y_1, x = query_states_1_cast_fp16, y = key_states_3_cast_fp16)[name = tensor<string, []>("attn_weights_1_cast_fp16")];
            tensor<int32, []> concat_6_axis_0 = const()[name = tensor<string, []>("concat_6_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_6_interleave_0 = const()[name = tensor<string, []>("concat_6_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> gather_7_cast_uint16_to_int32 = cast(dtype = gather_7_cast_uint16_to_int32_dtype_0, x = gather_7_cast_uint16)[name = tensor<string, []>("cast_93")];
            tensor<int32, []> gather_6_cast_uint16_to_int32 = cast(dtype = gather_6_cast_uint16_to_int32_dtype_0, x = gather_6_cast_uint16)[name = tensor<string, []>("cast_95")];
            tensor<int32, [4]> concat_6 = concat(axis = concat_6_axis_0, interleave = concat_6_interleave_0, values = (gather_5, var_16, gather_6_cast_uint16_to_int32, gather_7_cast_uint16_to_int32))[name = tensor<string, []>("concat_6")];
            tensor<fp16, [1, 6, ?, ?]> var_130_cast_fp16 = reshape(shape = concat_6, x = attn_weights_1_cast_fp16)[name = tensor<string, []>("op_130_cast_fp16")];
            tensor<fp16, [?, 6, ?, ?]> attn_weights_3_cast_fp16 = add(x = var_130_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("attn_weights_3_cast_fp16")];
            tensor<int32, []> var_134 = const()[name = tensor<string, []>("op_134"), val = tensor<int32, []>(6)];
            tensor<int32, []> concat_7_axis_0 = const()[name = tensor<string, []>("concat_7_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_7_interleave_0 = const()[name = tensor<string, []>("concat_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_7 = concat(axis = concat_7_axis_0, interleave = concat_7_interleave_0, values = (var_134, gather_6_cast_uint16_to_int32, gather_7_cast_uint16_to_int32))[name = tensor<string, []>("concat_7")];
            tensor<fp16, [6, ?, ?]> input_7_cast_fp16 = reshape(shape = concat_7, x = attn_weights_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [6, ?, ?]> input_9_cast_fp16 = softmax(axis = var_22, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, ?, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_9_cast_fp16, y = value_states_3_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> concat_8x = const()[name = tensor<string, []>("concat_8x"), val = tensor<int32, [4]>([1, 6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> attn_output_3_cast_fp16 = reshape(shape = concat_8x, x = attn_output_1_cast_fp16)[name = tensor<string, []>("attn_output_3_cast_fp16")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_9x = const()[name = tensor<string, []>("concat_9x"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, ?, 6, 64]> attn_output_5_cast_fp16 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<fp16, [1, ?, 384]> input_11_cast_fp16 = reshape(shape = concat_9x, x = attn_output_5_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41065664)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41360640)))];
            tensor<fp16, [1, ?, 384]> linear_3_cast_fp16 = linear(bias = decoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_15_cast_fp16 = add(x = input_3_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [1]> hidden_states_5_axes_0 = const()[name = tensor<string, []>("hidden_states_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41361472)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41362304)))];
            tensor<fp16, [1, ?, 384]> hidden_states_5_cast_fp16 = layer_norm(axes = hidden_states_5_axes_0, beta = decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41363136)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41658112)))];
            tensor<fp16, [1, ?, 384]> linear_4_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<fp16, []> var_164_to_fp16 = const()[name = tensor<string, []>("op_164_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_11_cast_fp16 = mul(x = linear_4_cast_fp16, y = var_164_to_fp16)[name = tensor<string, []>("tensor_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41658944)))];
            tensor<fp16, [1, 1500, 384]> linear_5_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [4]> var_168 = const()[name = tensor<string, []>("op_168"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_169_cast_fp16 = reshape(shape = var_168, x = linear_5_cast_fp16)[name = tensor<string, []>("op_169_cast_fp16")];
            tensor<int32, [4]> var_170_perm_0 = const()[name = tensor<string, []>("op_170_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41953920)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42248896)))];
            tensor<fp16, [1, 1500, 384]> linear_6_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> var_175 = const()[name = tensor<string, []>("op_175"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_176_cast_fp16 = reshape(shape = var_175, x = linear_6_cast_fp16)[name = tensor<string, []>("op_176_cast_fp16")];
            tensor<int32, [4]> var_177_perm_0 = const()[name = tensor<string, []>("op_177_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> concat_10x = const()[name = tensor<string, []>("concat_10x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_185_cast_fp16 = reshape(shape = concat_10x, x = tensor_11_cast_fp16)[name = tensor<string, []>("op_185_cast_fp16")];
            tensor<int32, [4]> var_186_perm_0 = const()[name = tensor<string, []>("op_186_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_188 = const()[name = tensor<string, []>("op_188"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_186_cast_fp16 = transpose(perm = var_186_perm_0, x = var_185_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [6, ?, 64]> query_states_3_cast_fp16 = reshape(shape = var_188, x = var_186_cast_fp16)[name = tensor<string, []>("query_states_3_cast_fp16")];
            tensor<int32, [3]> var_190 = const()[name = tensor<string, []>("op_190"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_170_cast_fp16 = transpose(perm = var_170_perm_0, x = var_169_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<fp16, [6, 1500, 64]> key_states_7_cast_fp16 = reshape(shape = var_190, x = var_170_cast_fp16)[name = tensor<string, []>("key_states_7_cast_fp16")];
            tensor<int32, [3]> var_192 = const()[name = tensor<string, []>("op_192"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_177_cast_fp16 = transpose(perm = var_177_perm_0, x = var_176_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [6, 1500, 64]> value_states_7_cast_fp16 = reshape(shape = var_192, x = var_177_cast_fp16)[name = tensor<string, []>("value_states_7_cast_fp16")];
            tensor<bool, []> attn_weights_7_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, ?, 1500]> attn_weights_7_cast_fp16 = matmul(transpose_x = attn_weights_7_transpose_x_1, transpose_y = attn_weights_7_transpose_y_1, x = query_states_3_cast_fp16, y = key_states_7_cast_fp16)[name = tensor<string, []>("attn_weights_7_cast_fp16")];
            tensor<fp16, [6, ?, 1500]> input_17_cast_fp16 = softmax(axis = var_22, x = attn_weights_7_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, ?, 64]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_17_cast_fp16, y = value_states_7_cast_fp16)[name = tensor<string, []>("attn_output_7_cast_fp16")];
            tensor<int32, [4]> concat_11x = const()[name = tensor<string, []>("concat_11x"), val = tensor<int32, [4]>([1, 6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> attn_output_9_cast_fp16 = reshape(shape = concat_11x, x = attn_output_7_cast_fp16)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_12x = const()[name = tensor<string, []>("concat_12x"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, ?, 6, 64]> attn_output_11_cast_fp16 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, ?, 384]> input_19_cast_fp16 = reshape(shape = concat_12x, x = attn_output_11_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42249728)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42544704)))];
            tensor<fp16, [1, ?, 384]> linear_7_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_out_proj_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_23_cast_fp16 = add(x = input_15_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [1]> input_25_axes_0 = const()[name = tensor<string, []>("input_25_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42545536)))];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42546368)))];
            tensor<fp16, [1, ?, 384]> input_25_cast_fp16 = layer_norm(axes = input_25_axes_0, beta = decoder_layers_0_final_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_0_final_layer_norm_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_0_fc1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42547200)))];
            tensor<fp16, [1536]> decoder_layers_0_fc1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43726912)))];
            tensor<fp16, [1, ?, 1536]> linear_8_cast_fp16 = linear(bias = decoder_layers_0_fc1_bias_to_fp16, weight = decoder_layers_0_fc1_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<string, []> input_29_mode_0 = const()[name = tensor<string, []>("input_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, ?, 1536]> input_29_cast_fp16 = gelu(mode = input_29_mode_0, x = linear_8_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [384, 1536]> decoder_layers_0_fc2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43730048)))];
            tensor<fp16, [384]> decoder_layers_0_fc2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44909760)))];
            tensor<fp16, [1, ?, 384]> linear_9_cast_fp16 = linear(bias = decoder_layers_0_fc2_bias_to_fp16, weight = decoder_layers_0_fc2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_35_cast_fp16 = add(x = input_23_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [1]> hidden_states_11_axes_0 = const()[name = tensor<string, []>("hidden_states_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44910592)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44911424)))];
            tensor<fp16, [1, ?, 384]> hidden_states_11_cast_fp16 = layer_norm(axes = hidden_states_11_axes_0, beta = decoder_layers_1_self_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_1_self_attn_layer_norm_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("hidden_states_11_cast_fp16")];
            tensor<int32, [3]> var_238_shape_cast_fp16 = shape(x = hidden_states_11_cast_fp16)[name = tensor<string, []>("op_238_shape_cast_fp16")];
            tensor<int32, []> gather_10 = const()[name = tensor<string, []>("gather_10"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_11_axis_0 = const()[name = tensor<string, []>("gather_11_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_11_batch_dims_0 = const()[name = tensor<string, []>("gather_11_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_11_validate_indices_0 = const()[name = tensor<string, []>("gather_11_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_238_shape_cast_fp16_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_238_shape_cast_fp16_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, []> gather_11_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_11_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [3]> var_238_shape_cast_fp16_to_uint16 = cast(dtype = var_238_shape_cast_fp16_to_uint16_dtype_0, x = var_238_shape_cast_fp16)[name = tensor<string, []>("cast_92")];
            tensor<uint16, []> gather_11_cast_uint16 = gather(axis = gather_11_axis_0, batch_dims = gather_11_batch_dims_0, indices = gather_11_indices_0_to_uint16, validate_indices = gather_11_validate_indices_0, x = var_238_shape_cast_fp16_to_uint16)[name = tensor<string, []>("gather_11_cast_uint16")];
            tensor<string, []> gather_11_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_11_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44912256)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45207232)))];
            tensor<fp16, [1, ?, 384]> linear_10_cast_fp16 = linear(bias = decoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<fp16, []> var_244_to_fp16 = const()[name = tensor<string, []>("op_244_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_17_cast_fp16 = mul(x = linear_10_cast_fp16, y = var_244_to_fp16)[name = tensor<string, []>("tensor_17_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45208064)))];
            tensor<fp16, [1, ?, 384]> linear_11_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<int32, [4]> var_248 = const()[name = tensor<string, []>("op_248"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_249_cast_fp16 = reshape(shape = var_248, x = linear_11_cast_fp16)[name = tensor<string, []>("op_249_cast_fp16")];
            tensor<int32, [4]> var_250_perm_0 = const()[name = tensor<string, []>("op_250_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45503040)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45798016)))];
            tensor<fp16, [1, ?, 384]> linear_12_cast_fp16 = linear(bias = decoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [4]> var_255 = const()[name = tensor<string, []>("op_255"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_256_cast_fp16 = reshape(shape = var_255, x = linear_12_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<int32, [4]> var_257_perm_0 = const()[name = tensor<string, []>("op_257_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> concat_13x = const()[name = tensor<string, []>("concat_13x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_265_cast_fp16 = reshape(shape = concat_13x, x = tensor_17_cast_fp16)[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<int32, [4]> var_266_perm_0 = const()[name = tensor<string, []>("op_266_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_268 = const()[name = tensor<string, []>("op_268"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_266_cast_fp16 = transpose(perm = var_266_perm_0, x = var_265_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [6, ?, 64]> query_states_5_cast_fp16 = reshape(shape = var_268, x = var_266_cast_fp16)[name = tensor<string, []>("query_states_5_cast_fp16")];
            tensor<int32, [3]> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_250_cast_fp16 = transpose(perm = var_250_perm_0, x = var_249_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [6, ?, 64]> key_states_11_cast_fp16 = reshape(shape = var_270, x = var_250_cast_fp16)[name = tensor<string, []>("key_states_11_cast_fp16")];
            tensor<int32, [3]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_257_cast_fp16 = transpose(perm = var_257_perm_0, x = var_256_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [6, ?, 64]> value_states_11_cast_fp16 = reshape(shape = var_272, x = var_257_cast_fp16)[name = tensor<string, []>("value_states_11_cast_fp16")];
            tensor<int32, [3]> var_274_shape_cast_fp16 = shape(x = key_states_11_cast_fp16)[name = tensor<string, []>("op_274_shape_cast_fp16")];
            tensor<int32, []> gather_12_axis_0 = const()[name = tensor<string, []>("gather_12_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_12_batch_dims_0 = const()[name = tensor<string, []>("gather_12_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_12_validate_indices_0 = const()[name = tensor<string, []>("gather_12_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_274_shape_cast_fp16_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_274_shape_cast_fp16_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, []> gather_12_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_12_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [3]> var_274_shape_cast_fp16_to_uint16 = cast(dtype = var_274_shape_cast_fp16_to_uint16_dtype_0, x = var_274_shape_cast_fp16)[name = tensor<string, []>("cast_90")];
            tensor<uint16, []> gather_12_cast_uint16 = gather(axis = gather_12_axis_0, batch_dims = gather_12_batch_dims_0, indices = gather_12_indices_0_to_uint16, validate_indices = gather_12_validate_indices_0, x = var_274_shape_cast_fp16_to_uint16)[name = tensor<string, []>("gather_12_cast_uint16")];
            tensor<string, []> gather_12_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_12_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
