program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0b1"}})]
{
    func main<ios17>(tensor<fp16, [1, 1500, 384]> encoder_output, tensor<int32, [1, 3]> input_ids) {
            tensor<int32, []> var_22 = const()[name = tensor<string, []>("op_22"), val = tensor<int32, []>(-1)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> inputs_embeds_validate_indices_0 = const()[name = tensor<string, []>("inputs_embeds_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51865, 384]> decoder_embed_tokens_weight_to_fp16 = const()[name = tensor<string, []>("decoder_embed_tokens_weight_to_fp16"), val = tensor<fp16, [51865, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, []> greater_equal_0_y_0 = const()[name = tensor<string, []>("greater_equal_0_y_0"), val = tensor<int32, []>(0)];
            tensor<bool, [1, 3]> greater_equal_0 = greater_equal(x = input_ids, y = greater_equal_0_y_0)[name = tensor<string, []>("greater_equal_0")];
            tensor<int32, []> slice_by_index_0 = const()[name = tensor<string, []>("slice_by_index_0"), val = tensor<int32, []>(51865)];
            tensor<int32, [1, 3]> add_0 = add(x = input_ids, y = slice_by_index_0)[name = tensor<string, []>("add_0")];
            tensor<int32, [1, 3]> select_0 = select(a = input_ids, b = add_0, cond = greater_equal_0)[name = tensor<string, []>("select_0")];
            tensor<int32, []> inputs_embeds_cast_fp16_axis_0 = const()[name = tensor<string, []>("inputs_embeds_cast_fp16_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 3, 384]> inputs_embeds_cast_fp16 = gather(axis = inputs_embeds_cast_fp16_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = select_0, validate_indices = inputs_embeds_validate_indices_0, x = decoder_embed_tokens_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast_fp16")];
            tensor<fp16, [3, 384]> positions_to_fp16 = const()[name = tensor<string, []>("positions_to_fp16"), val = tensor<fp16, [3, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39832448)))];
            tensor<fp16, [1, 3, 384]> input_3_cast_fp16 = add(x = inputs_embeds_cast_fp16, y = positions_to_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39834816)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39835648)))];
            tensor<fp16, []> var_8_to_fp16 = const()[name = tensor<string, []>("op_8_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 3, 384]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = decoder_layers_0_self_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_0_self_attn_layer_norm_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39836480)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40131456)))];
            tensor<fp16, [1, 3, 384]> linear_0_cast_fp16 = linear(bias = decoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, []> var_96_to_fp16 = const()[name = tensor<string, []>("op_96_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 3, 384]> tensor_5_cast_fp16 = mul(x = linear_0_cast_fp16, y = var_96_to_fp16)[name = tensor<string, []>("tensor_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40132288)))];
            tensor<fp16, [384]> linear_1_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_1_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40427264)))];
            tensor<fp16, [1, 3, 384]> linear_1_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> var_100 = const()[name = tensor<string, []>("op_100"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_101_cast_fp16 = reshape(shape = var_100, x = linear_1_cast_fp16)[name = tensor<string, []>("op_101_cast_fp16")];
            tensor<int32, [4]> var_102_perm_0 = const()[name = tensor<string, []>("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40428096)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40723072)))];
            tensor<fp16, [1, 3, 384]> linear_2_cast_fp16 = linear(bias = decoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_107 = const()[name = tensor<string, []>("op_107"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_108_cast_fp16 = reshape(shape = var_107, x = linear_2_cast_fp16)[name = tensor<string, []>("op_108_cast_fp16")];
            tensor<int32, [4]> var_109_perm_0 = const()[name = tensor<string, []>("op_109_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [4]>([1, 3, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_117_cast_fp16 = reshape(shape = var_116, x = tensor_5_cast_fp16)[name = tensor<string, []>("op_117_cast_fp16")];
            tensor<int32, [4]> var_118_perm_0 = const()[name = tensor<string, []>("op_118_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_118_cast_fp16 = transpose(perm = var_118_perm_0, x = var_117_cast_fp16)[name = tensor<string, []>("transpose_29")];
            tensor<fp16, [6, 3, 64]> query_states_1_cast_fp16 = reshape(shape = var_120, x = var_118_cast_fp16)[name = tensor<string, []>("query_states_1_cast_fp16")];
            tensor<int32, [3]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_102_cast_fp16 = transpose(perm = var_102_perm_0, x = var_101_cast_fp16)[name = tensor<string, []>("transpose_31")];
            tensor<fp16, [6, 3, 64]> key_states_3_cast_fp16 = reshape(shape = var_122, x = var_102_cast_fp16)[name = tensor<string, []>("key_states_3_cast_fp16")];
            tensor<int32, [3]> var_124 = const()[name = tensor<string, []>("op_124"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_109_cast_fp16 = transpose(perm = var_109_perm_0, x = var_108_cast_fp16)[name = tensor<string, []>("transpose_30")];
            tensor<fp16, [6, 3, 64]> value_states_3_cast_fp16 = reshape(shape = var_124, x = var_109_cast_fp16)[name = tensor<string, []>("value_states_3_cast_fp16")];
            tensor<bool, []> attn_weights_1_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 3, 3]> attn_weights_1_cast_fp16 = matmul(transpose_x = attn_weights_1_transpose_x_1, transpose_y = attn_weights_1_transpose_y_1, x = query_states_1_cast_fp16, y = key_states_3_cast_fp16)[name = tensor<string, []>("attn_weights_1_cast_fp16")];
            tensor<int32, [4]> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, [4]>([1, 6, 3, 3])];
            tensor<fp16, [1, 6, 3, 3]> var_130_cast_fp16 = reshape(shape = var_129, x = attn_weights_1_cast_fp16)[name = tensor<string, []>("op_130_cast_fp16")];
            tensor<fp16, [1, 1, 3, 3]> var_59_to_fp16 = const()[name = tensor<string, []>("op_59_to_fp16"), val = tensor<fp16, [1, 1, 3, 3]>([[[[0x0p+0, -inf, -inf], [0x0p+0, 0x0p+0, -inf], [0x0p+0, 0x0p+0, 0x0p+0]]]])];
            tensor<fp16, [1, 6, 3, 3]> attn_weights_3_cast_fp16 = add(x = var_130_cast_fp16, y = var_59_to_fp16)[name = tensor<string, []>("attn_weights_3_cast_fp16")];
            tensor<int32, [3]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [3]>([6, 3, 3])];
            tensor<fp16, [6, 3, 3]> input_7_cast_fp16 = reshape(shape = var_135, x = attn_weights_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [6, 3, 3]> input_9_cast_fp16 = softmax(axis = var_22, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 3, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_9_cast_fp16, y = value_states_3_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [4]>([1, 6, 3, 64])];
            tensor<fp16, [1, 6, 3, 64]> attn_output_3_cast_fp16 = reshape(shape = var_140, x = attn_output_1_cast_fp16)[name = tensor<string, []>("attn_output_3_cast_fp16")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_143 = const()[name = tensor<string, []>("op_143"), val = tensor<int32, [3]>([1, 3, 384])];
            tensor<fp16, [1, 3, 6, 64]> attn_output_5_cast_fp16 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<fp16, [1, 3, 384]> input_11_cast_fp16 = reshape(shape = var_143, x = attn_output_5_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40723904)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41018880)))];
            tensor<fp16, [1, 3, 384]> linear_3_cast_fp16 = linear(bias = decoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 3, 384]> input_15_cast_fp16 = add(x = input_3_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [1]> hidden_states_5_axes_0 = const()[name = tensor<string, []>("hidden_states_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41019712)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41020544)))];
            tensor<fp16, [1, 3, 384]> hidden_states_5_cast_fp16 = layer_norm(axes = hidden_states_5_axes_0, beta = decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41021376)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41316352)))];
            tensor<fp16, [1, 3, 384]> linear_4_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<fp16, []> var_168_to_fp16 = const()[name = tensor<string, []>("op_168_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 3, 384]> tensor_11_cast_fp16 = mul(x = linear_4_cast_fp16, y = var_168_to_fp16)[name = tensor<string, []>("tensor_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41317184)))];
            tensor<fp16, [1, 1500, 384]> linear_5_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [4]> var_172 = const()[name = tensor<string, []>("op_172"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_173_cast_fp16 = reshape(shape = var_172, x = linear_5_cast_fp16)[name = tensor<string, []>("op_173_cast_fp16")];
            tensor<int32, [4]> var_174_perm_0 = const()[name = tensor<string, []>("op_174_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41612160)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41907136)))];
            tensor<fp16, [1, 1500, 384]> linear_6_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> var_179 = const()[name = tensor<string, []>("op_179"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_180_cast_fp16 = reshape(shape = var_179, x = linear_6_cast_fp16)[name = tensor<string, []>("op_180_cast_fp16")];
            tensor<int32, [4]> var_181_perm_0 = const()[name = tensor<string, []>("op_181_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_188 = const()[name = tensor<string, []>("op_188"), val = tensor<int32, [4]>([1, 3, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_189_cast_fp16 = reshape(shape = var_188, x = tensor_11_cast_fp16)[name = tensor<string, []>("op_189_cast_fp16")];
            tensor<int32, [4]> var_190_perm_0 = const()[name = tensor<string, []>("op_190_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_192 = const()[name = tensor<string, []>("op_192"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_190_cast_fp16 = transpose(perm = var_190_perm_0, x = var_189_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [6, 3, 64]> query_states_3_cast_fp16 = reshape(shape = var_192, x = var_190_cast_fp16)[name = tensor<string, []>("query_states_3_cast_fp16")];
            tensor<int32, [3]> var_194 = const()[name = tensor<string, []>("op_194"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_174_cast_fp16 = transpose(perm = var_174_perm_0, x = var_173_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<fp16, [6, 1500, 64]> key_states_7_cast_fp16 = reshape(shape = var_194, x = var_174_cast_fp16)[name = tensor<string, []>("key_states_7_cast_fp16")];
            tensor<int32, [3]> var_196 = const()[name = tensor<string, []>("op_196"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_181_cast_fp16 = transpose(perm = var_181_perm_0, x = var_180_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [6, 1500, 64]> value_states_7_cast_fp16 = reshape(shape = var_196, x = var_181_cast_fp16)[name = tensor<string, []>("value_states_7_cast_fp16")];
            tensor<bool, []> attn_weights_7_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 3, 1500]> attn_weights_7_cast_fp16 = matmul(transpose_x = attn_weights_7_transpose_x_1, transpose_y = attn_weights_7_transpose_y_1, x = query_states_3_cast_fp16, y = key_states_7_cast_fp16)[name = tensor<string, []>("attn_weights_7_cast_fp16")];
            tensor<fp16, [6, 3, 1500]> input_17_cast_fp16 = softmax(axis = var_22, x = attn_weights_7_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 3, 64]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_17_cast_fp16, y = value_states_7_cast_fp16)[name = tensor<string, []>("attn_output_7_cast_fp16")];
            tensor<int32, [4]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [4]>([1, 6, 3, 64])];
            tensor<fp16, [1, 6, 3, 64]> attn_output_9_cast_fp16 = reshape(shape = var_203, x = attn_output_7_cast_fp16)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_206 = const()[name = tensor<string, []>("op_206"), val = tensor<int32, [3]>([1, 3, 384])];
            tensor<fp16, [1, 3, 6, 64]> attn_output_11_cast_fp16 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, 3, 384]> input_19_cast_fp16 = reshape(shape = var_206, x = attn_output_11_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41907968)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42202944)))];
            tensor<fp16, [1, 3, 384]> linear_7_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_out_proj_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, 3, 384]> input_23_cast_fp16 = add(x = input_15_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [1]> input_25_axes_0 = const()[name = tensor<string, []>("input_25_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42203776)))];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42204608)))];
            tensor<fp16, [1, 3, 384]> input_25_cast_fp16 = layer_norm(axes = input_25_axes_0, beta = decoder_layers_0_final_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_0_final_layer_norm_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_0_fc1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42205440)))];
            tensor<fp16, [1536]> decoder_layers_0_fc1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43385152)))];
            tensor<fp16, [1, 3, 1536]> linear_8_cast_fp16 = linear(bias = decoder_layers_0_fc1_bias_to_fp16, weight = decoder_layers_0_fc1_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<string, []> input_29_mode_0 = const()[name = tensor<string, []>("input_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 3, 1536]> input_29_cast_fp16 = gelu(mode = input_29_mode_0, x = linear_8_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [384, 1536]> decoder_layers_0_fc2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43388288)))];
            tensor<fp16, [384]> decoder_layers_0_fc2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44568000)))];
            tensor<fp16, [1, 3, 384]> linear_9_cast_fp16 = linear(bias = decoder_layers_0_fc2_bias_to_fp16, weight = decoder_layers_0_fc2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 3, 384]> input_35_cast_fp16 = add(x = input_23_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [1]> hidden_states_11_axes_0 = const()[name = tensor<string, []>("hidden_states_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44568832)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44569664)))];
            tensor<fp16, [1, 3, 384]> hidden_states_11_cast_fp16 = layer_norm(axes = hidden_states_11_axes_0, beta = decoder_layers_1_self_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_1_self_attn_layer_norm_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("hidden_states_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44570496)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44865472)))];
            tensor<fp16, [1, 3, 384]> linear_10_cast_fp16 = linear(bias = decoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<fp16, []> var_252_to_fp16 = const()[name = tensor<string, []>("op_252_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 3, 384]> tensor_17_cast_fp16 = mul(x = linear_10_cast_fp16, y = var_252_to_fp16)[name = tensor<string, []>("tensor_17_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44866304)))];
            tensor<fp16, [1, 3, 384]> linear_11_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<int32, [4]> var_256 = const()[name = tensor<string, []>("op_256"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_257_cast_fp16 = reshape(shape = var_256, x = linear_11_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<int32, [4]> var_258_perm_0 = const()[name = tensor<string, []>("op_258_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45161280)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45456256)))];
            tensor<fp16, [1, 3, 384]> linear_12_cast_fp16 = linear(bias = decoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [4]> var_263 = const()[name = tensor<string, []>("op_263"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_264_cast_fp16 = reshape(shape = var_263, x = linear_12_cast_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<int32, [4]> var_265_perm_0 = const()[name = tensor<string, []>("op_265_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [4]>([1, 3, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_273_cast_fp16 = reshape(shape = var_272, x = tensor_17_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<int32, [4]> var_274_perm_0 = const()[name = tensor<string, []>("op_274_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_276 = const()[name = tensor<string, []>("op_276"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_274_cast_fp16 = transpose(perm = var_274_perm_0, x = var_273_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [6, 3, 64]> query_states_5_cast_fp16 = reshape(shape = var_276, x = var_274_cast_fp16)[name = tensor<string, []>("query_states_5_cast_fp16")];
            tensor<int32, [3]> var_278 = const()[name = tensor<string, []>("op_278"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_258_cast_fp16 = transpose(perm = var_258_perm_0, x = var_257_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [6, 3, 64]> key_states_11_cast_fp16 = reshape(shape = var_278, x = var_258_cast_fp16)[name = tensor<string, []>("key_states_11_cast_fp16")];
            tensor<int32, [3]> var_280 = const()[name = tensor<string, []>("op_280"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_265_cast_fp16 = transpose(perm = var_265_perm_0, x = var_264_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [6, 3, 64]> value_states_11_cast_fp16 = reshape(shape = var_280, x = var_265_cast_fp16)[name = tensor<string, []>("value_states_11_cast_fp16")];
            tensor<bool, []> attn_weights_11_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_11_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_11_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_11_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 3, 3]> attn_weights_11_cast_fp16 = matmul(transpose_x = attn_weights_11_transpose_x_1, transpose_y = attn_weights_11_transpose_y_1, x = query_states_5_cast_fp16, y = key_states_11_cast_fp16)[name = tensor<string, []>("attn_weights_11_cast_fp16")];
            tensor<int32, [4]> var_285 = const()[name = tensor<string, []>("op_285"), val = tensor<int32, [4]>([1, 6, 3, 3])];
            tensor<fp16, [1, 6, 3, 3]> var_286_cast_fp16 = reshape(shape = var_285, x = attn_weights_11_cast_fp16)[name = tensor<string, []>("op_286_cast_fp16")];
            tensor<fp16, [1, 6, 3, 3]> attn_weights_13_cast_fp16 = add(x = var_286_cast_fp16, y = var_59_to_fp16)[name = tensor<string, []>("attn_weights_13_cast_fp16")];
            tensor<int32, [3]> var_291 = const()[name = tensor<string, []>("op_291"), val = tensor<int32, [3]>([6, 3, 3])];
            tensor<fp16, [6, 3, 3]> input_37_cast_fp16 = reshape(shape = var_291, x = attn_weights_13_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [6, 3, 3]> input_39_cast_fp16 = softmax(axis = var_22, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 3, 64]> attn_output_13_cast_fp16 = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_39_cast_fp16, y = value_states_11_cast_fp16)[name = tensor<string, []>("attn_output_13_cast_fp16")];
            tensor<int32, [4]> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, [4]>([1, 6, 3, 64])];
            tensor<fp16, [1, 6, 3, 64]> attn_output_15_cast_fp16 = reshape(shape = var_296, x = attn_output_13_cast_fp16)[name = tensor<string, []>("attn_output_15_cast_fp16")];
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_299 = const()[name = tensor<string, []>("op_299"), val = tensor<int32, [3]>([1, 3, 384])];
            tensor<fp16, [1, 3, 6, 64]> attn_output_17_cast_fp16 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast_fp16)[name = tensor<string, []>("transpose_20")];
            tensor<fp16, [1, 3, 384]> input_41_cast_fp16 = reshape(shape = var_299, x = attn_output_17_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45457088)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45752064)))];
            tensor<fp16, [1, 3, 384]> linear_13_cast_fp16 = linear(bias = decoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [1, 3, 384]> input_45_cast_fp16 = add(x = input_35_cast_fp16, y = linear_13_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<int32, [1]> hidden_states_15_axes_0 = const()[name = tensor<string, []>("hidden_states_15_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45752896)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45753728)))];
            tensor<fp16, [1, 3, 384]> hidden_states_15_cast_fp16 = layer_norm(axes = hidden_states_15_axes_0, beta = decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("hidden_states_15_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45754560)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46049536)))];
            tensor<fp16, [1, 3, 384]> linear_14_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_15_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<fp16, []> var_324_to_fp16 = const()[name = tensor<string, []>("op_324_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 3, 384]> tensor_23_cast_fp16 = mul(x = linear_14_cast_fp16, y = var_324_to_fp16)[name = tensor<string, []>("tensor_23_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46050368)))];
            tensor<fp16, [1, 1500, 384]> linear_15_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<int32, [4]> var_328 = const()[name = tensor<string, []>("op_328"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_329_cast_fp16 = reshape(shape = var_328, x = linear_15_cast_fp16)[name = tensor<string, []>("op_329_cast_fp16")];
            tensor<int32, [4]> var_330_perm_0 = const()[name = tensor<string, []>("op_330_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46345344)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46640320)))];
            tensor<fp16, [1, 1500, 384]> linear_16_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<int32, [4]> var_335 = const()[name = tensor<string, []>("op_335"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_336_cast_fp16 = reshape(shape = var_335, x = linear_16_cast_fp16)[name = tensor<string, []>("op_336_cast_fp16")];
            tensor<int32, [4]> var_337_perm_0 = const()[name = tensor<string, []>("op_337_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_344 = const()[name = tensor<string, []>("op_344"), val = tensor<int32, [4]>([1, 3, 6, 64])];
            tensor<fp16, [1, 3, 6, 64]> var_345_cast_fp16 = reshape(shape = var_344, x = tensor_23_cast_fp16)[name = tensor<string, []>("op_345_cast_fp16")];
            tensor<int32, [4]> var_346_perm_0 = const()[name = tensor<string, []>("op_346_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_348 = const()[name = tensor<string, []>("op_348"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 3, 64]> var_346_cast_fp16 = transpose(perm = var_346_perm_0, x = var_345_cast_fp16)[name = tensor<string, []>("transpose_17")];
            tensor<fp16, [6, 3, 64]> query_states_7_cast_fp16 = reshape(shape = var_348, x = var_346_cast_fp16)[name = tensor<string, []>("query_states_7_cast_fp16")];
            tensor<int32, [3]> var_350 = const()[name = tensor<string, []>("op_350"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_330_cast_fp16 = transpose(perm = var_330_perm_0, x = var_329_cast_fp16)[name = tensor<string, []>("transpose_19")];
            tensor<fp16, [6, 1500, 64]> key_states_15_cast_fp16 = reshape(shape = var_350, x = var_330_cast_fp16)[name = tensor<string, []>("key_states_15_cast_fp16")];
            tensor<int32, [3]> var_352 = const()[name = tensor<string, []>("op_352"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_337_cast_fp16 = transpose(perm = var_337_perm_0, x = var_336_cast_fp16)[name = tensor<string, []>("transpose_18")];
            tensor<fp16, [6, 1500, 64]> value_states_15_cast_fp16 = reshape(shape = var_352, x = var_337_cast_fp16)[name = tensor<string, []>("value_states_15_cast_fp16")];
            tensor<bool, []> attn_weights_17_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_17_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_17_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_17_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 3, 1500]> attn_weights_17_cast_fp16 = matmul(transpose_x = attn_weights_17_transpose_x_1, transpose_y = attn_weights_17_transpose_y_1, x = query_states_7_cast_fp16, y = key_states_15_cast_fp16)[name = tensor<string, []>("attn_weights_17_cast_fp16")];
            tensor<fp16, [6, 3, 1500]> input_47_cast_fp16 = softmax(axis = var_22, x = attn_weights_17_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<bool, []> attn_output_19_transpose_x_0 = const()[name = tensor<string, []>("attn_output_19_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_19_transpose_y_0 = const()[name = tensor<string, []>("attn_output_19_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 3, 64]> attn_output_19_cast_fp16 = matmul(transpose_x = attn_output_19_transpose_x_0, transpose_y = attn_output_19_transpose_y_0, x = input_47_cast_fp16, y = value_states_15_cast_fp16)[name = tensor<string, []>("attn_output_19_cast_fp16")];
            tensor<int32, [4]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [4]>([1, 6, 3, 64])];
            tensor<fp16, [1, 6, 3, 64]> attn_output_21_cast_fp16 = reshape(shape = var_359, x = attn_output_19_cast_fp16)[name = tensor<string, []>("attn_output_21_cast_fp16")];
            tensor<int32, [4]> attn_output_23_perm_0 = const()[name = tensor<string, []>("attn_output_23_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_362 = const()[name = tensor<string, []>("op_362"), val = tensor<int32, [3]>([1, 3, 384])];
            tensor<fp16, [1, 3, 6, 64]> attn_output_23_cast_fp16 = transpose(perm = attn_output_23_perm_0, x = attn_output_21_cast_fp16)[name = tensor<string, []>("transpose_16")];
            tensor<fp16, [1, 3, 384]> input_49_cast_fp16 = reshape(shape = var_362, x = attn_output_23_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46641152)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46936128)))];
            tensor<fp16, [1, 3, 384]> linear_17_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_out_proj_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 3, 384]> input_53_cast_fp16 = add(x = input_45_cast_fp16, y = linear_17_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<int32, [1]> input_55_axes_0 = const()[name = tensor<string, []>("input_55_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_final_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46936960)))];
            tensor<fp16, [384]> decoder_layers_1_final_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46937792)))];
            tensor<fp16, [1, 3, 384]> input_55_cast_fp16 = layer_norm(axes = input_55_axes_0, beta = decoder_layers_1_final_layer_norm_bias_to_fp16, epsilon = var_8_to_fp16, gamma = decoder_layers_1_final_layer_norm_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_1_fc1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46938624)))];
            tensor<fp16, [1536]> decoder_layers_1_fc1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48118336)))];
            tensor<fp16, [1, 3, 1536]> linear_18_cast_fp16 = linear(bias = decoder_layers_1_fc1_bias_to_fp16, weight = decoder_layers_1_fc1_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<string, []> input_59_mode_0 = const()[name = tensor<string, []>("input_59_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 3, 1536]> input_59_cast_fp16 = gelu(mode = input_59_mode_0, x = linear_18_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<fp16, [384, 1536]> decoder_layers_1_fc2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48121472)))];
            tensor<fp16, [384]> decoder_layers_1_fc2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49301184)))];
            tensor<fp16, [1, 3, 384]> linear_19_cast_fp16 = linear(bias = decoder_layers_1_fc2_bias_to_fp16, weight = decoder_layers_1_fc2_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<fp16, [1, 3, 384]> input_65_cast_fp16 = add(x = input_53_cast_fp16, y = linear_19_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
