program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0b1"}})]
{
    func main<ios17>(tensor<fp16, [1, 1500, 384]> encoder_output, tensor<int32, [1, 1]> input_id, tensor<fp16, [1, 6, 8, 64]> pk0, tensor<fp16, [1, 6, 8, 64]> pk1, tensor<fp16, [1, 6, 8, 64]> pk2, tensor<fp16, [1, 6, 8, 64]> pk3, tensor<fp16, [1, 6, 8, 64]> pv0, tensor<fp16, [1, 6, 8, 64]> pv1, tensor<fp16, [1, 6, 8, 64]> pv2, tensor<fp16, [1, 6, 8, 64]> pv3) {
            tensor<int32, []> var_26 = const()[name = tensor<string, []>("op_26"), val = tensor<int32, []>(2)];
            tensor<int32, []> var_27 = const()[name = tensor<string, []>("op_27"), val = tensor<int32, []>(-1)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> inputs_embeds_validate_indices_0 = const()[name = tensor<string, []>("inputs_embeds_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51865, 384]> decoder_embed_tokens_weight_to_fp16 = const()[name = tensor<string, []>("decoder_embed_tokens_weight_to_fp16"), val = tensor<fp16, [51865, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, []> greater_equal_0_y_0 = const()[name = tensor<string, []>("greater_equal_0_y_0"), val = tensor<int32, []>(0)];
            tensor<bool, [1, 1]> greater_equal_0 = greater_equal(x = input_id, y = greater_equal_0_y_0)[name = tensor<string, []>("greater_equal_0")];
            tensor<int32, []> slice_by_index_0 = const()[name = tensor<string, []>("slice_by_index_0"), val = tensor<int32, []>(51865)];
            tensor<int32, [1, 1]> add_0 = add(x = input_id, y = slice_by_index_0)[name = tensor<string, []>("add_0")];
            tensor<int32, [1, 1]> select_0 = select(a = input_id, b = add_0, cond = greater_equal_0)[name = tensor<string, []>("select_0")];
            tensor<int32, []> inputs_embeds_cast_fp16_axis_0 = const()[name = tensor<string, []>("inputs_embeds_cast_fp16_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 1, 384]> inputs_embeds_cast_fp16 = gather(axis = inputs_embeds_cast_fp16_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = select_0, validate_indices = inputs_embeds_validate_indices_0, x = decoder_embed_tokens_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast_fp16")];
            tensor<fp16, [1, 384]> positions_to_fp16 = const()[name = tensor<string, []>("positions_to_fp16"), val = tensor<fp16, [1, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39832448)))];
            tensor<fp16, [1, 1, 384]> input_3_cast_fp16 = add(x = inputs_embeds_cast_fp16, y = positions_to_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39833280)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39834112)))];
            tensor<fp16, []> var_16_to_fp16 = const()[name = tensor<string, []>("op_16_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 384]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = decoder_layers_0_self_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_0_self_attn_layer_norm_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39834944)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40129920)))];
            tensor<fp16, [1, 1, 384]> linear_0_cast_fp16 = linear(bias = decoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, []> var_76_to_fp16 = const()[name = tensor<string, []>("op_76_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1, 384]> tensor_5_cast_fp16 = mul(x = linear_0_cast_fp16, y = var_76_to_fp16)[name = tensor<string, []>("tensor_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40130752)))];
            tensor<fp16, [384]> linear_1_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_1_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40425728)))];
            tensor<fp16, [1, 1, 384]> linear_1_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_81_cast_fp16 = reshape(shape = var_80, x = linear_1_cast_fp16)[name = tensor<string, []>("op_81_cast_fp16")];
            tensor<int32, [4]> var_82_perm_0 = const()[name = tensor<string, []>("op_82_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40426560)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40721536)))];
            tensor<fp16, [1, 1, 384]> linear_2_cast_fp16 = linear(bias = decoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_87 = const()[name = tensor<string, []>("op_87"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_88_cast_fp16 = reshape(shape = var_87, x = linear_2_cast_fp16)[name = tensor<string, []>("op_88_cast_fp16")];
            tensor<int32, [4]> var_89_perm_0 = const()[name = tensor<string, []>("op_89_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> key_states_3_interleave_0 = const()[name = tensor<string, []>("key_states_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1, 64]> var_82_cast_fp16 = transpose(perm = var_82_perm_0, x = var_81_cast_fp16)[name = tensor<string, []>("transpose_31")];
            tensor<fp16, [1, 6, 9, 64]> key_states_3_cast_fp16 = concat(axis = var_26, interleave = key_states_3_interleave_0, values = (pk0, var_82_cast_fp16))[name = tensor<string, []>("key_states_3_cast_fp16")];
            tensor<bool, []> value_states_3_interleave_0 = const()[name = tensor<string, []>("value_states_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1, 64]> var_89_cast_fp16 = transpose(perm = var_89_perm_0, x = var_88_cast_fp16)[name = tensor<string, []>("transpose_30")];
            tensor<fp16, [1, 6, 9, 64]> value_states_3_cast_fp16 = concat(axis = var_26, interleave = value_states_3_interleave_0, values = (pv0, var_89_cast_fp16))[name = tensor<string, []>("value_states_3_cast_fp16")];
            tensor<int32, [4]> var_100 = const()[name = tensor<string, []>("op_100"), val = tensor<int32, [4]>([1, 1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_101_cast_fp16 = reshape(shape = var_100, x = tensor_5_cast_fp16)[name = tensor<string, []>("op_101_cast_fp16")];
            tensor<int32, [4]> var_102_perm_0 = const()[name = tensor<string, []>("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_104 = const()[name = tensor<string, []>("op_104"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1, 64]> var_102_cast_fp16 = transpose(perm = var_102_perm_0, x = var_101_cast_fp16)[name = tensor<string, []>("transpose_29")];
            tensor<fp16, [6, 1, 64]> query_states_1_cast_fp16 = reshape(shape = var_104, x = var_102_cast_fp16)[name = tensor<string, []>("query_states_1_cast_fp16")];
            tensor<int32, [3]> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, 9, 64]> key_states_5_cast_fp16 = reshape(shape = var_106, x = key_states_3_cast_fp16)[name = tensor<string, []>("key_states_5_cast_fp16")];
            tensor<int32, [3]> var_108 = const()[name = tensor<string, []>("op_108"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, 9, 64]> value_states_5_cast_fp16 = reshape(shape = var_108, x = value_states_3_cast_fp16)[name = tensor<string, []>("value_states_5_cast_fp16")];
            tensor<bool, []> attn_weights_1_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 1, 9]> attn_weights_1_cast_fp16 = matmul(transpose_x = attn_weights_1_transpose_x_1, transpose_y = attn_weights_1_transpose_y_1, x = query_states_1_cast_fp16, y = key_states_5_cast_fp16)[name = tensor<string, []>("attn_weights_1_cast_fp16")];
            tensor<fp16, [6, 1, 9]> input_7_cast_fp16 = softmax(axis = var_27, x = attn_weights_1_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 1, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast_fp16, y = value_states_5_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_115 = const()[name = tensor<string, []>("op_115"), val = tensor<int32, [4]>([1, 6, 1, 64])];
            tensor<fp16, [1, 6, 1, 64]> attn_output_3_cast_fp16 = reshape(shape = var_115, x = attn_output_1_cast_fp16)[name = tensor<string, []>("attn_output_3_cast_fp16")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_118 = const()[name = tensor<string, []>("op_118"), val = tensor<int32, [3]>([1, 1, 384])];
            tensor<fp16, [1, 1, 6, 64]> attn_output_5_cast_fp16 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<fp16, [1, 1, 384]> input_9_cast_fp16 = reshape(shape = var_118, x = attn_output_5_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40722368)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41017344)))];
            tensor<fp16, [1, 1, 384]> linear_3_cast_fp16 = linear(bias = decoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 1, 384]> input_13_cast_fp16 = add(x = input_3_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [1]> hidden_states_5_axes_0 = const()[name = tensor<string, []>("hidden_states_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41018176)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41019008)))];
            tensor<fp16, [1, 1, 384]> hidden_states_5_cast_fp16 = layer_norm(axes = hidden_states_5_axes_0, beta = decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41019840)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41314816)))];
            tensor<fp16, [1, 1, 384]> linear_4_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<fp16, []> var_143_to_fp16 = const()[name = tensor<string, []>("op_143_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1, 384]> tensor_11_cast_fp16 = mul(x = linear_4_cast_fp16, y = var_143_to_fp16)[name = tensor<string, []>("tensor_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41315648)))];
            tensor<fp16, [1, 1500, 384]> linear_5_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [4]> var_147 = const()[name = tensor<string, []>("op_147"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_148_cast_fp16 = reshape(shape = var_147, x = linear_5_cast_fp16)[name = tensor<string, []>("op_148_cast_fp16")];
            tensor<int32, [4]> var_149_perm_0 = const()[name = tensor<string, []>("op_149_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41610624)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41905600)))];
            tensor<fp16, [1, 1500, 384]> linear_6_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> var_154 = const()[name = tensor<string, []>("op_154"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_155_cast_fp16 = reshape(shape = var_154, x = linear_6_cast_fp16)[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<int32, [4]> var_156_perm_0 = const()[name = tensor<string, []>("op_156_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_163 = const()[name = tensor<string, []>("op_163"), val = tensor<int32, [4]>([1, 1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_164_cast_fp16 = reshape(shape = var_163, x = tensor_11_cast_fp16)[name = tensor<string, []>("op_164_cast_fp16")];
            tensor<int32, [4]> var_165_perm_0 = const()[name = tensor<string, []>("op_165_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1, 64]> var_165_cast_fp16 = transpose(perm = var_165_perm_0, x = var_164_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [6, 1, 64]> query_states_3_cast_fp16 = reshape(shape = var_167, x = var_165_cast_fp16)[name = tensor<string, []>("query_states_3_cast_fp16")];
            tensor<int32, [3]> var_169 = const()[name = tensor<string, []>("op_169"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_149_cast_fp16 = transpose(perm = var_149_perm_0, x = var_148_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<fp16, [6, 1500, 64]> key_states_9_cast_fp16 = reshape(shape = var_169, x = var_149_cast_fp16)[name = tensor<string, []>("key_states_9_cast_fp16")];
            tensor<int32, [3]> var_171 = const()[name = tensor<string, []>("op_171"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_156_cast_fp16 = transpose(perm = var_156_perm_0, x = var_155_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [6, 1500, 64]> value_states_9_cast_fp16 = reshape(shape = var_171, x = var_156_cast_fp16)[name = tensor<string, []>("value_states_9_cast_fp16")];
            tensor<bool, []> attn_weights_5_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_5_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_5_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_5_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 1, 1500]> attn_weights_5_cast_fp16 = matmul(transpose_x = attn_weights_5_transpose_x_1, transpose_y = attn_weights_5_transpose_y_1, x = query_states_3_cast_fp16, y = key_states_9_cast_fp16)[name = tensor<string, []>("attn_weights_5_cast_fp16")];
            tensor<fp16, [6, 1, 1500]> input_15_cast_fp16 = softmax(axis = var_27, x = attn_weights_5_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 1, 64]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_15_cast_fp16, y = value_states_9_cast_fp16)[name = tensor<string, []>("attn_output_7_cast_fp16")];
            tensor<int32, [4]> var_178 = const()[name = tensor<string, []>("op_178"), val = tensor<int32, [4]>([1, 6, 1, 64])];
            tensor<fp16, [1, 6, 1, 64]> attn_output_9_cast_fp16 = reshape(shape = var_178, x = attn_output_7_cast_fp16)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<int32, [3]>([1, 1, 384])];
            tensor<fp16, [1, 1, 6, 64]> attn_output_11_cast_fp16 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, 1, 384]> input_17_cast_fp16 = reshape(shape = var_181, x = attn_output_11_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41906432)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42201408)))];
            tensor<fp16, [1, 1, 384]> linear_7_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_out_proj_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, 1, 384]> input_21_cast_fp16 = add(x = input_13_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [1]> input_23_axes_0 = const()[name = tensor<string, []>("input_23_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42202240)))];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42203072)))];
            tensor<fp16, [1, 1, 384]> input_23_cast_fp16 = layer_norm(axes = input_23_axes_0, beta = decoder_layers_0_final_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_0_final_layer_norm_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_0_fc1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42203904)))];
            tensor<fp16, [1536]> decoder_layers_0_fc1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43383616)))];
            tensor<fp16, [1, 1, 1536]> linear_8_cast_fp16 = linear(bias = decoder_layers_0_fc1_bias_to_fp16, weight = decoder_layers_0_fc1_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<string, []> input_27_mode_0 = const()[name = tensor<string, []>("input_27_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1, 1536]> input_27_cast_fp16 = gelu(mode = input_27_mode_0, x = linear_8_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [384, 1536]> decoder_layers_0_fc2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43386752)))];
            tensor<fp16, [384]> decoder_layers_0_fc2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_0_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44566464)))];
            tensor<fp16, [1, 1, 384]> linear_9_cast_fp16 = linear(bias = decoder_layers_0_fc2_bias_to_fp16, weight = decoder_layers_0_fc2_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 1, 384]> input_33_cast_fp16 = add(x = input_21_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [1]> hidden_states_11_axes_0 = const()[name = tensor<string, []>("hidden_states_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44567296)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44568128)))];
            tensor<fp16, [1, 1, 384]> hidden_states_11_cast_fp16 = layer_norm(axes = hidden_states_11_axes_0, beta = decoder_layers_1_self_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_1_self_attn_layer_norm_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("hidden_states_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44568960)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44863936)))];
            tensor<fp16, [1, 1, 384]> linear_10_cast_fp16 = linear(bias = decoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<fp16, []> var_227_to_fp16 = const()[name = tensor<string, []>("op_227_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1, 384]> tensor_17_cast_fp16 = mul(x = linear_10_cast_fp16, y = var_227_to_fp16)[name = tensor<string, []>("tensor_17_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44864768)))];
            tensor<fp16, [1, 1, 384]> linear_11_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<int32, [4]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_232_cast_fp16 = reshape(shape = var_231, x = linear_11_cast_fp16)[name = tensor<string, []>("op_232_cast_fp16")];
            tensor<int32, [4]> var_233_perm_0 = const()[name = tensor<string, []>("op_233_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45159744)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45454720)))];
            tensor<fp16, [1, 1, 384]> linear_12_cast_fp16 = linear(bias = decoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [4]> var_238 = const()[name = tensor<string, []>("op_238"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_239_cast_fp16 = reshape(shape = var_238, x = linear_12_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<int32, [4]> var_240_perm_0 = const()[name = tensor<string, []>("op_240_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> key_states_13_interleave_0 = const()[name = tensor<string, []>("key_states_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1, 64]> var_233_cast_fp16 = transpose(perm = var_233_perm_0, x = var_232_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [1, 6, 9, 64]> key_states_13_cast_fp16 = concat(axis = var_26, interleave = key_states_13_interleave_0, values = (pk1, var_233_cast_fp16))[name = tensor<string, []>("key_states_13_cast_fp16")];
            tensor<bool, []> value_states_13_interleave_0 = const()[name = tensor<string, []>("value_states_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1, 64]> var_240_cast_fp16 = transpose(perm = var_240_perm_0, x = var_239_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [1, 6, 9, 64]> value_states_13_cast_fp16 = concat(axis = var_26, interleave = value_states_13_interleave_0, values = (pv1, var_240_cast_fp16))[name = tensor<string, []>("value_states_13_cast_fp16")];
            tensor<int32, [4]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [4]>([1, 1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_252_cast_fp16 = reshape(shape = var_251, x = tensor_17_cast_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<int32, [4]> var_253_perm_0 = const()[name = tensor<string, []>("op_253_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_255 = const()[name = tensor<string, []>("op_255"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1, 64]> var_253_cast_fp16 = transpose(perm = var_253_perm_0, x = var_252_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [6, 1, 64]> query_states_5_cast_fp16 = reshape(shape = var_255, x = var_253_cast_fp16)[name = tensor<string, []>("query_states_5_cast_fp16")];
            tensor<int32, [3]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, 9, 64]> key_states_15_cast_fp16 = reshape(shape = var_257, x = key_states_13_cast_fp16)[name = tensor<string, []>("key_states_15_cast_fp16")];
            tensor<int32, [3]> var_259 = const()[name = tensor<string, []>("op_259"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, 9, 64]> value_states_15_cast_fp16 = reshape(shape = var_259, x = value_states_13_cast_fp16)[name = tensor<string, []>("value_states_15_cast_fp16")];
            tensor<bool, []> attn_weights_9_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_9_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_9_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_9_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 1, 9]> attn_weights_9_cast_fp16 = matmul(transpose_x = attn_weights_9_transpose_x_1, transpose_y = attn_weights_9_transpose_y_1, x = query_states_5_cast_fp16, y = key_states_15_cast_fp16)[name = tensor<string, []>("attn_weights_9_cast_fp16")];
            tensor<fp16, [6, 1, 9]> input_35_cast_fp16 = softmax(axis = var_27, x = attn_weights_9_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 1, 64]> attn_output_13_cast_fp16 = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_35_cast_fp16, y = value_states_15_cast_fp16)[name = tensor<string, []>("attn_output_13_cast_fp16")];
            tensor<int32, [4]> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, [4]>([1, 6, 1, 64])];
            tensor<fp16, [1, 6, 1, 64]> attn_output_15_cast_fp16 = reshape(shape = var_266, x = attn_output_13_cast_fp16)[name = tensor<string, []>("attn_output_15_cast_fp16")];
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [3]>([1, 1, 384])];
            tensor<fp16, [1, 1, 6, 64]> attn_output_17_cast_fp16 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast_fp16)[name = tensor<string, []>("transpose_20")];
            tensor<fp16, [1, 1, 384]> input_37_cast_fp16 = reshape(shape = var_269, x = attn_output_17_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45455552)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45750528)))];
            tensor<fp16, [1, 1, 384]> linear_13_cast_fp16 = linear(bias = decoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [1, 1, 384]> input_41_cast_fp16 = add(x = input_33_cast_fp16, y = linear_13_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> hidden_states_15_axes_0 = const()[name = tensor<string, []>("hidden_states_15_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45751360)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45752192)))];
            tensor<fp16, [1, 1, 384]> hidden_states_15_cast_fp16 = layer_norm(axes = hidden_states_15_axes_0, beta = decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("hidden_states_15_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45753024)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46048000)))];
            tensor<fp16, [1, 1, 384]> linear_14_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_15_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<fp16, []> var_294_to_fp16 = const()[name = tensor<string, []>("op_294_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1, 384]> tensor_23_cast_fp16 = mul(x = linear_14_cast_fp16, y = var_294_to_fp16)[name = tensor<string, []>("tensor_23_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46048832)))];
            tensor<fp16, [1, 1500, 384]> linear_15_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<int32, [4]> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_299_cast_fp16 = reshape(shape = var_298, x = linear_15_cast_fp16)[name = tensor<string, []>("op_299_cast_fp16")];
            tensor<int32, [4]> var_300_perm_0 = const()[name = tensor<string, []>("op_300_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46343808)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46638784)))];
            tensor<fp16, [1, 1500, 384]> linear_16_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<int32, [4]> var_305 = const()[name = tensor<string, []>("op_305"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_306_cast_fp16 = reshape(shape = var_305, x = linear_16_cast_fp16)[name = tensor<string, []>("op_306_cast_fp16")];
            tensor<int32, [4]> var_307_perm_0 = const()[name = tensor<string, []>("op_307_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_314 = const()[name = tensor<string, []>("op_314"), val = tensor<int32, [4]>([1, 1, 6, 64])];
            tensor<fp16, [1, 1, 6, 64]> var_315_cast_fp16 = reshape(shape = var_314, x = tensor_23_cast_fp16)[name = tensor<string, []>("op_315_cast_fp16")];
            tensor<int32, [4]> var_316_perm_0 = const()[name = tensor<string, []>("op_316_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_318 = const()[name = tensor<string, []>("op_318"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1, 64]> var_316_cast_fp16 = transpose(perm = var_316_perm_0, x = var_315_cast_fp16)[name = tensor<string, []>("transpose_17")];
            tensor<fp16, [6, 1, 64]> query_states_7_cast_fp16 = reshape(shape = var_318, x = var_316_cast_fp16)[name = tensor<string, []>("query_states_7_cast_fp16")];
            tensor<int32, [3]> var_320 = const()[name = tensor<string, []>("op_320"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_300_cast_fp16 = transpose(perm = var_300_perm_0, x = var_299_cast_fp16)[name = tensor<string, []>("transpose_19")];
            tensor<fp16, [6, 1500, 64]> key_states_19_cast_fp16 = reshape(shape = var_320, x = var_300_cast_fp16)[name = tensor<string, []>("key_states_19_cast_fp16")];
            tensor<int32, [3]> var_322 = const()[name = tensor<string, []>("op_322"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_307_cast_fp16 = transpose(perm = var_307_perm_0, x = var_306_cast_fp16)[name = tensor<string, []>("transpose_18")];
            tensor<fp16, [6, 1500, 64]> value_states_19_cast_fp16 = reshape(shape = var_322, x = var_307_cast_fp16)[name = tensor<string, []>("value_states_19_cast_fp16")];
            tensor<bool, []> attn_weights_13_transpose_x_1 = const()[name = tensor<string, []>("attn_weights_13_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_13_transpose_y_1 = const()[name = tensor<string, []>("attn_weights_13_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [6, 1, 1500]> attn_weights_13_cast_fp16 = matmul(transpose_x = attn_weights_13_transpose_x_1, transpose_y = attn_weights_13_transpose_y_1, x = query_states_7_cast_fp16, y = key_states_19_cast_fp16)[name = tensor<string, []>("attn_weights_13_cast_fp16")];
            tensor<fp16, [6, 1, 1500]> input_43_cast_fp16 = softmax(axis = var_27, x = attn_weights_13_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<bool, []> attn_output_19_transpose_x_0 = const()[name = tensor<string, []>("attn_output_19_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_19_transpose_y_0 = const()[name = tensor<string, []>("attn_output_19_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [6, 1, 64]> attn_output_19_cast_fp16 = matmul(transpose_x = attn_output_19_transpose_x_0, transpose_y = attn_output_19_transpose_y_0, x = input_43_cast_fp16, y = value_states_19_cast_fp16)[name = tensor<string, []>("attn_output_19_cast_fp16")];
            tensor<int32, [4]> var_329 = const()[name = tensor<string, []>("op_329"), val = tensor<int32, [4]>([1, 6, 1, 64])];
            tensor<fp16, [1, 6, 1, 64]> attn_output_21_cast_fp16 = reshape(shape = var_329, x = attn_output_19_cast_fp16)[name = tensor<string, []>("attn_output_21_cast_fp16")];
            tensor<int32, [4]> attn_output_23_perm_0 = const()[name = tensor<string, []>("attn_output_23_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_332 = const()[name = tensor<string, []>("op_332"), val = tensor<int32, [3]>([1, 1, 384])];
            tensor<fp16, [1, 1, 6, 64]> attn_output_23_cast_fp16 = transpose(perm = attn_output_23_perm_0, x = attn_output_21_cast_fp16)[name = tensor<string, []>("transpose_16")];
            tensor<fp16, [1, 1, 384]> input_45_cast_fp16 = reshape(shape = var_332, x = attn_output_23_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46639616)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46934592)))];
            tensor<fp16, [1, 1, 384]> linear_17_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_out_proj_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 1, 384]> input_49_cast_fp16 = add(x = input_41_cast_fp16, y = linear_17_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<int32, [1]> input_51_axes_0 = const()[name = tensor<string, []>("input_51_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_final_layer_norm_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46935424)))];
            tensor<fp16, [384]> decoder_layers_1_final_layer_norm_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46936256)))];
            tensor<fp16, [1, 1, 384]> input_51_cast_fp16 = layer_norm(axes = input_51_axes_0, beta = decoder_layers_1_final_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_1_final_layer_norm_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_1_fc1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46937088)))];
            tensor<fp16, [1536]> decoder_layers_1_fc1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48116800)))];
            tensor<fp16, [1, 1, 1536]> linear_18_cast_fp16 = linear(bias = decoder_layers_1_fc1_bias_to_fp16, weight = decoder_layers_1_fc1_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<string, []> input_55_mode_0 = const()[name = tensor<string, []>("input_55_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1, 1536]> input_55_cast_fp16 = gelu(mode = input_55_mode_0, x = linear_18_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [384, 1536]> decoder_layers_1_fc2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48119936)))];
            tensor<fp16, [384]> decoder_layers_1_fc2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_layers_1_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49299648)))];
            tensor<fp16, [1, 1, 384]> linear_19_cast_fp16 = linear(bias = decoder_layers_1_fc2_bias_to_fp16, weight = decoder_layers_1_fc2_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
