program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0b1"}})]
{
    func main<ios18>(tensor<fp16, [1, 1500, 384]> encoder_output, tensor<int32, [1, 1]> input_id, tensor<fp16, [1, 6, ?, 64]> pk0, tensor<fp16, [1, 6, ?, 64]> pk1, tensor<fp16, [1, 6, ?, 64]> pk2, tensor<fp16, [1, 6, ?, 64]> pk3, tensor<fp16, [1, 6, ?, 64]> pv0, tensor<fp16, [1, 6, ?, 64]> pv1, tensor<fp16, [1, 6, ?, 64]> pv2, tensor<fp16, [1, 6, ?, 64]> pv3) [FlexibleShapeInformation = tuple<tuple<string, dict<string, tensor<int32, [?]>>>, tuple<string, dict<string, dict<string, tensor<int32, [?]>>>>>((("DefaultShapes", {{"pk0", [1, 6, 3, 64]}, {"pk1", [1, 6, 3, 64]}, {"pk2", [1, 6, 3, 64]}, {"pk3", [1, 6, 3, 64]}, {"pv0", [1, 6, 3, 64]}, {"pv1", [1, 6, 3, 64]}, {"pv2", [1, 6, 3, 64]}, {"pv3", [1, 6, 3, 64]}}), ("EnumeratedShapes", {{"0a736ed2", {{"encoder_output", [1, 1500, 384]}, {"input_id", [1, 1]}, {"pk0", [1, 6, 4, 64]}, {"pk1", [1, 6, 4, 64]}, {"pk2", [1, 6, 4, 64]}, {"pk3", [1, 6, 4, 64]}, {"pv0", [1, 6, 4, 64]}, {"pv1", [1, 6, 4, 64]}, {"pv2", [1, 6, 4, 64]}, {"pv3", [1, 6, 4, 64]}}}, {"289ca341", {{"encoder_output", [1, 1500, 384]}, {"input_id", [1, 1]}, {"pk0", [1, 6, 5, 64]}, {"pk1", [1, 6, 5, 64]}, {"pk2", [1, 6, 5, 64]}, {"pk3", [1, 6, 5, 64]}, {"pv0", [1, 6, 5, 64]}, {"pv1", [1, 6, 5, 64]}, {"pv2", [1, 6, 5, 64]}, {"pv3", [1, 6, 5, 64]}}}, {"3bad33ff", {{"encoder_output", [1, 1500, 384]}, {"input_id", [1, 1]}, {"pk0", [1, 6, 7, 64]}, {"pk1", [1, 6, 7, 64]}, {"pk2", [1, 6, 7, 64]}, {"pk3", [1, 6, 7, 64]}, {"pv0", [1, 6, 7, 64]}, {"pv1", [1, 6, 7, 64]}, {"pv2", [1, 6, 7, 64]}, {"pv3", [1, 6, 7, 64]}}}, {"3ccc9893", {{"encoder_output", [1, 1500, 384]}, {"input_id", [1, 1]}, {"pk0", [1, 6, 3, 64]}, {"pk1", [1, 6, 3, 64]}, {"pk2", [1, 6, 3, 64]}, {"pk3", [1, 6, 3, 64]}, {"pv0", [1, 6, 3, 64]}, {"pv1", [1, 6, 3, 64]}, {"pv2", [1, 6, 3, 64]}, {"pv3", [1, 6, 3, 64]}}}, {"6085cff3", {{"encoder_output", [1, 1500, 384]}, {"input_id", [1, 1]}, {"pk0", [1, 6, 6, 64]}, {"pk1", [1, 6, 6, 64]}, {"pk2", [1, 6, 6, 64]}, {"pk3", [1, 6, 6, 64]}, {"pv0", [1, 6, 6, 64]}, {"pv1", [1, 6, 6, 64]}, {"pv2", [1, 6, 6, 64]}, {"pv3", [1, 6, 6, 64]}}}, {"c5c84fe2", {{"encoder_output", [1, 1500, 384]}, {"input_id", [1, 1]}, {"pk0", [1, 6, 8, 64]}, {"pk1", [1, 6, 8, 64]}, {"pk2", [1, 6, 8, 64]}, {"pk3", [1, 6, 8, 64]}, {"pv0", [1, 6, 8, 64]}, {"pv1", [1, 6, 8, 64]}, {"pv2", [1, 6, 8, 64]}, {"pv3", [1, 6, 8, 64]}}}})))] {
            int32 var_26 = const()[name = string("op_26"), val = int32(2)];
            int32 var_27 = const()[name = string("op_27"), val = int32(-1)];
            tensor<int32, [4]> var_43_shape_cast_fp16 = shape(x = pk0)[name = string("op_43_shape_cast_fp16")];
            int32 gather_0_axis_0 = const()[name = string("gather_0_axis_0"), val = int32(0)];
            int32 gather_0_batch_dims_0 = const()[name = string("gather_0_batch_dims_0"), val = int32(0)];
            bool gather_0_validate_indices_0 = const()[name = string("gather_0_validate_indices_0"), val = bool(false)];
            string var_43_shape_cast_fp16_to_int16_dtype_0 = const()[name = string("op_43_shape_cast_fp16_to_int16_dtype_0"), val = string("int16")];
            uint16 gather_0_indices_0_to_uint16 = const()[name = string("gather_0_indices_0_to_uint16"), val = uint16(2)];
            tensor<int16, [4]> var_43_shape_cast_fp16_to_int16 = cast(dtype = var_43_shape_cast_fp16_to_int16_dtype_0, x = var_43_shape_cast_fp16)[name = string("cast_87")];
            int16 gather_0_cast_uint16 = gather(axis = gather_0_axis_0, batch_dims = gather_0_batch_dims_0, indices = gather_0_indices_0_to_uint16, validate_indices = gather_0_validate_indices_0, x = var_43_shape_cast_fp16_to_int16)[name = string("gather_0_cast_uint16")];
            string gather_0_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_0_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 inputs_embeds_batch_dims_0 = const()[name = string("inputs_embeds_batch_dims_0"), val = int32(0)];
            bool inputs_embeds_validate_indices_0 = const()[name = string("inputs_embeds_validate_indices_0"), val = bool(false)];
            tensor<fp16, [51865, 384]> decoder_embed_tokens_weight_to_fp16 = const()[name = string("decoder_embed_tokens_weight_to_fp16"), val = tensor<fp16, [51865, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            int32 greater_equal_0_y_0 = const()[name = string("greater_equal_0_y_0"), val = int32(0)];
            tensor<bool, [1, 1]> greater_equal_0 = greater_equal(x = input_id, y = greater_equal_0_y_0)[name = string("greater_equal_0")];
            int32 slice_by_index_0 = const()[name = string("slice_by_index_0"), val = int32(51865)];
            tensor<int32, [1, 1]> add_0 = add(x = input_id, y = slice_by_index_0)[name = string("add_0")];
            tensor<int32, [1, 1]> select_0 = select(a = input_id, b = add_0, cond = greater_equal_0)[name = string("select_0")];
            int32 inputs_embeds_cast_fp16_axis_0 = const()[name = string("inputs_embeds_cast_fp16_axis_0"), val = int32(0)];
            tensor<fp16, [1, 1, 384]> inputs_embeds_cast_fp16 = gather(axis = inputs_embeds_cast_fp16_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = select_0, validate_indices = inputs_embeds_validate_indices_0, x = decoder_embed_tokens_weight_to_fp16)[name = string("inputs_embeds_cast_fp16")];
            tensor<int32, [1]> var_49 = const()[name = string("op_49"), val = tensor<int32, [1]>([1])];
            int32 gather_0_cast_uint16_to_int32 = cast(dtype = gather_0_cast_uint16_to_int32_dtype_0, x = gather_0_cast_uint16)[name = string("cast_86")];
            tensor<int32, [1]> var_50 = add(x = gather_0_cast_uint16_to_int32, y = var_49)[name = string("op_50")];
            string var_50_to_uint16_dtype_0 = const()[name = string("op_50_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [1]> var_50_to_uint16 = cast(dtype = var_50_to_uint16_dtype_0, x = var_50)[name = string("cast_85")];
            uint16 var_51_item_cast_uint16 = squeeze(x = var_50_to_uint16)[name = string("op_51_item_cast_uint16")];
            string var_51_item_cast_uint16_to_int32_dtype_0 = const()[name = string("op_51_item_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_0_values1_0 = const()[name = string("concat_0_values1_0"), val = int32(0)];
            int32 concat_0_axis_0 = const()[name = string("concat_0_axis_0"), val = int32(0)];
            bool concat_0_interleave_0 = const()[name = string("concat_0_interleave_0"), val = bool(false)];
            tensor<int32, [2]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (gather_0_cast_uint16_to_int32, concat_0_values1_0))[name = string("concat_0")];
            int32 concat_1_values1_0 = const()[name = string("concat_1_values1_0"), val = int32(384)];
            int32 concat_1_axis_0 = const()[name = string("concat_1_axis_0"), val = int32(0)];
            bool concat_1_interleave_0 = const()[name = string("concat_1_interleave_0"), val = bool(false)];
            int32 var_51_item_cast_uint16_to_int32 = cast(dtype = var_51_item_cast_uint16_to_int32_dtype_0, x = var_51_item_cast_uint16)[name = string("cast_84")];
            tensor<int32, [2]> concat_1 = concat(axis = concat_1_axis_0, interleave = concat_1_interleave_0, values = (var_51_item_cast_uint16_to_int32, concat_1_values1_0))[name = string("concat_1")];
            tensor<bool, [2]> positions_end_mask_0 = const()[name = string("positions_end_mask_0"), val = tensor<bool, [2]>([false, true])];
            tensor<fp16, [448, 384]> decoder_embed_positions_weight_to_fp16 = const()[name = string("decoder_embed_positions_weight_to_fp16"), val = tensor<fp16, [448, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(39832448)))];
            tensor<fp16, [?, ?]> positions_cast_fp16 = slice_by_index(begin = concat_0, end = concat_1, end_mask = positions_end_mask_0, x = decoder_embed_positions_weight_to_fp16)[name = string("positions_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_3_cast_fp16 = add(x = inputs_embeds_cast_fp16, y = positions_cast_fp16)[name = string("input_3_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = string("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_weight_to_fp16 = const()[name = string("decoder_layers_0_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40176576)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_layer_norm_bias_to_fp16 = const()[name = string("decoder_layers_0_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40177408)))];
            fp16 var_16_to_fp16 = const()[name = string("op_16_to_fp16"), val = fp16(0x1.5p-17)];
            tensor<fp16, [1, ?, 384]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = decoder_layers_0_self_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_0_self_attn_layer_norm_weight_to_fp16, x = input_3_cast_fp16)[name = string("hidden_states_1_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40178240)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = string("decoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40473216)))];
            tensor<fp16, [1, ?, 384]> linear_0_cast_fp16 = linear(bias = decoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = string("linear_0_cast_fp16")];
            fp16 var_76_to_fp16 = const()[name = string("op_76_to_fp16"), val = fp16(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_5_cast_fp16 = mul(x = linear_0_cast_fp16, y = var_76_to_fp16)[name = string("tensor_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40474048)))];
            tensor<fp16, [384]> linear_1_bias_0_to_fp16 = const()[name = string("linear_1_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40769024)))];
            tensor<fp16, [1, ?, 384]> linear_1_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = string("linear_1_cast_fp16")];
            tensor<int32, [4]> var_80 = const()[name = string("op_80"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_81_cast_fp16 = reshape(shape = var_80, x = linear_1_cast_fp16)[name = string("op_81_cast_fp16")];
            tensor<int32, [4]> var_82_perm_0 = const()[name = string("op_82_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40769856)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = string("decoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41064832)))];
            tensor<fp16, [1, ?, 384]> linear_2_cast_fp16 = linear(bias = decoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = string("linear_2_cast_fp16")];
            tensor<int32, [4]> var_87 = const()[name = string("op_87"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_88_cast_fp16 = reshape(shape = var_87, x = linear_2_cast_fp16)[name = string("op_88_cast_fp16")];
            tensor<int32, [4]> var_89_perm_0 = const()[name = string("op_89_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            bool key_states_3_interleave_0 = const()[name = string("key_states_3_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 6, ?, 64]> var_82_cast_fp16 = transpose(perm = var_82_perm_0, x = var_81_cast_fp16)[name = string("transpose_31")];
            tensor<fp16, [1, 6, ?, 64]> npk0 = concat(axis = var_26, interleave = key_states_3_interleave_0, values = (pk0, var_82_cast_fp16))[name = string("key_states_3_cast_fp16")];
            bool value_states_3_interleave_0 = const()[name = string("value_states_3_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 6, ?, 64]> var_89_cast_fp16 = transpose(perm = var_89_perm_0, x = var_88_cast_fp16)[name = string("transpose_30")];
            tensor<fp16, [1, 6, ?, 64]> npv0 = concat(axis = var_26, interleave = value_states_3_interleave_0, values = (pv0, var_89_cast_fp16))[name = string("value_states_3_cast_fp16")];
            tensor<int32, [4]> concat_2x = const()[name = string("concat_2x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_101_cast_fp16 = reshape(shape = concat_2x, x = tensor_5_cast_fp16)[name = string("op_101_cast_fp16")];
            tensor<int32, [4]> var_102_perm_0 = const()[name = string("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_104 = const()[name = string("op_104"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_102_cast_fp16 = transpose(perm = var_102_perm_0, x = var_101_cast_fp16)[name = string("transpose_29")];
            tensor<fp16, [6, ?, 64]> query_states_1_cast_fp16 = reshape(shape = var_104, x = var_102_cast_fp16)[name = string("query_states_1_cast_fp16")];
            tensor<int32, [3]> var_106 = const()[name = string("op_106"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, ?, 64]> key_states_5_cast_fp16 = reshape(shape = var_106, x = npk0)[name = string("key_states_5_cast_fp16")];
            tensor<int32, [3]> var_108 = const()[name = string("op_108"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, ?, 64]> value_states_5_cast_fp16 = reshape(shape = var_108, x = npv0)[name = string("value_states_5_cast_fp16")];
            bool attn_weights_1_transpose_x_1 = const()[name = string("attn_weights_1_transpose_x_1"), val = bool(false)];
            bool attn_weights_1_transpose_y_1 = const()[name = string("attn_weights_1_transpose_y_1"), val = bool(true)];
            tensor<fp16, [6, ?, ?]> attn_weights_1_cast_fp16 = matmul(transpose_x = attn_weights_1_transpose_x_1, transpose_y = attn_weights_1_transpose_y_1, x = query_states_1_cast_fp16, y = key_states_5_cast_fp16)[name = string("attn_weights_1_cast_fp16")];
            tensor<fp16, [6, ?, ?]> input_7_cast_fp16 = softmax(axis = var_27, x = attn_weights_1_cast_fp16)[name = string("input_7_cast_fp16")];
            bool attn_output_1_transpose_x_0 = const()[name = string("attn_output_1_transpose_x_0"), val = bool(false)];
            bool attn_output_1_transpose_y_0 = const()[name = string("attn_output_1_transpose_y_0"), val = bool(false)];
            tensor<fp16, [6, ?, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast_fp16, y = value_states_5_cast_fp16)[name = string("attn_output_1_cast_fp16")];
            tensor<int32, [4]> concat_3x = const()[name = string("concat_3x"), val = tensor<int32, [4]>([1, 6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> attn_output_3_cast_fp16 = reshape(shape = concat_3x, x = attn_output_1_cast_fp16)[name = string("attn_output_3_cast_fp16")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = string("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_4x = const()[name = string("concat_4x"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, ?, 6, 64]> attn_output_5_cast_fp16 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast_fp16)[name = string("transpose_28")];
            tensor<fp16, [1, ?, 384]> input_9_cast_fp16 = reshape(shape = concat_4x, x = attn_output_5_cast_fp16)[name = string("input_9_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41065664)))];
            tensor<fp16, [384]> decoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = string("decoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41360640)))];
            tensor<fp16, [1, ?, 384]> linear_3_cast_fp16 = linear(bias = decoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_9_cast_fp16)[name = string("linear_3_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_13_cast_fp16 = add(x = input_3_cast_fp16, y = linear_3_cast_fp16)[name = string("input_13_cast_fp16")];
            tensor<int32, [1]> hidden_states_5_axes_0 = const()[name = string("hidden_states_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41361472)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41362304)))];
            tensor<fp16, [1, ?, 384]> hidden_states_5_cast_fp16 = layer_norm(axes = hidden_states_5_axes_0, beta = decoder_layers_0_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_0_encoder_attn_layer_norm_weight_to_fp16, x = input_13_cast_fp16)[name = string("hidden_states_5_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_q_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41363136)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_q_proj_bias_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41658112)))];
            tensor<fp16, [1, ?, 384]> linear_4_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = string("linear_4_cast_fp16")];
            fp16 var_143_to_fp16 = const()[name = string("op_143_to_fp16"), val = fp16(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_11_cast_fp16 = mul(x = linear_4_cast_fp16, y = var_143_to_fp16)[name = string("tensor_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_k_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41658944)))];
            tensor<fp16, [1, 1500, 384]> linear_5_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_0_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = string("linear_5_cast_fp16")];
            tensor<int32, [4]> var_147 = const()[name = string("op_147"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_148_cast_fp16 = reshape(shape = var_147, x = linear_5_cast_fp16)[name = string("op_148_cast_fp16")];
            tensor<int32, [4]> var_149_perm_0 = const()[name = string("op_149_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_v_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41953920)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_v_proj_bias_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(42248896)))];
            tensor<fp16, [1, 1500, 384]> linear_6_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = string("linear_6_cast_fp16")];
            tensor<int32, [4]> var_154 = const()[name = string("op_154"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_155_cast_fp16 = reshape(shape = var_154, x = linear_6_cast_fp16)[name = string("op_155_cast_fp16")];
            tensor<int32, [4]> var_156_perm_0 = const()[name = string("op_156_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> concat_5x = const()[name = string("concat_5x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_164_cast_fp16 = reshape(shape = concat_5x, x = tensor_11_cast_fp16)[name = string("op_164_cast_fp16")];
            tensor<int32, [4]> var_165_perm_0 = const()[name = string("op_165_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_167 = const()[name = string("op_167"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_165_cast_fp16 = transpose(perm = var_165_perm_0, x = var_164_cast_fp16)[name = string("transpose_25")];
            tensor<fp16, [6, ?, 64]> query_states_3_cast_fp16 = reshape(shape = var_167, x = var_165_cast_fp16)[name = string("query_states_3_cast_fp16")];
            tensor<int32, [3]> var_169 = const()[name = string("op_169"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_149_cast_fp16 = transpose(perm = var_149_perm_0, x = var_148_cast_fp16)[name = string("transpose_27")];
            tensor<fp16, [6, 1500, 64]> key_states_9_cast_fp16 = reshape(shape = var_169, x = var_149_cast_fp16)[name = string("key_states_9_cast_fp16")];
            tensor<int32, [3]> var_171 = const()[name = string("op_171"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_156_cast_fp16 = transpose(perm = var_156_perm_0, x = var_155_cast_fp16)[name = string("transpose_26")];
            tensor<fp16, [6, 1500, 64]> value_states_9_cast_fp16 = reshape(shape = var_171, x = var_156_cast_fp16)[name = string("value_states_9_cast_fp16")];
            bool attn_weights_5_transpose_x_1 = const()[name = string("attn_weights_5_transpose_x_1"), val = bool(false)];
            bool attn_weights_5_transpose_y_1 = const()[name = string("attn_weights_5_transpose_y_1"), val = bool(true)];
            tensor<fp16, [6, ?, 1500]> attn_weights_5_cast_fp16 = matmul(transpose_x = attn_weights_5_transpose_x_1, transpose_y = attn_weights_5_transpose_y_1, x = query_states_3_cast_fp16, y = key_states_9_cast_fp16)[name = string("attn_weights_5_cast_fp16")];
            tensor<fp16, [6, ?, 1500]> input_15_cast_fp16 = softmax(axis = var_27, x = attn_weights_5_cast_fp16)[name = string("input_15_cast_fp16")];
            bool attn_output_7_transpose_x_0 = const()[name = string("attn_output_7_transpose_x_0"), val = bool(false)];
            bool attn_output_7_transpose_y_0 = const()[name = string("attn_output_7_transpose_y_0"), val = bool(false)];
            tensor<fp16, [6, ?, 64]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_15_cast_fp16, y = value_states_9_cast_fp16)[name = string("attn_output_7_cast_fp16")];
            tensor<int32, [4]> concat_6x = const()[name = string("concat_6x"), val = tensor<int32, [4]>([1, 6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> attn_output_9_cast_fp16 = reshape(shape = concat_6x, x = attn_output_7_cast_fp16)[name = string("attn_output_9_cast_fp16")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = string("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_7x = const()[name = string("concat_7x"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, ?, 6, 64]> attn_output_11_cast_fp16 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast_fp16)[name = string("transpose_24")];
            tensor<fp16, [1, ?, 384]> input_17_cast_fp16 = reshape(shape = concat_7x, x = attn_output_11_cast_fp16)[name = string("input_17_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_0_encoder_attn_out_proj_weight_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(42249728)))];
            tensor<fp16, [384]> decoder_layers_0_encoder_attn_out_proj_bias_to_fp16 = const()[name = string("decoder_layers_0_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(42544704)))];
            tensor<fp16, [1, ?, 384]> linear_7_cast_fp16 = linear(bias = decoder_layers_0_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_0_encoder_attn_out_proj_weight_to_fp16, x = input_17_cast_fp16)[name = string("linear_7_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_21_cast_fp16 = add(x = input_13_cast_fp16, y = linear_7_cast_fp16)[name = string("input_21_cast_fp16")];
            tensor<int32, [1]> input_23_axes_0 = const()[name = string("input_23_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_weight_to_fp16 = const()[name = string("decoder_layers_0_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(42545536)))];
            tensor<fp16, [384]> decoder_layers_0_final_layer_norm_bias_to_fp16 = const()[name = string("decoder_layers_0_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(42546368)))];
            tensor<fp16, [1, ?, 384]> input_23_cast_fp16 = layer_norm(axes = input_23_axes_0, beta = decoder_layers_0_final_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_0_final_layer_norm_weight_to_fp16, x = input_21_cast_fp16)[name = string("input_23_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_0_fc1_weight_to_fp16 = const()[name = string("decoder_layers_0_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(42547200)))];
            tensor<fp16, [1536]> decoder_layers_0_fc1_bias_to_fp16 = const()[name = string("decoder_layers_0_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(43726912)))];
            tensor<fp16, [1, ?, 1536]> linear_8_cast_fp16 = linear(bias = decoder_layers_0_fc1_bias_to_fp16, weight = decoder_layers_0_fc1_weight_to_fp16, x = input_23_cast_fp16)[name = string("linear_8_cast_fp16")];
            string input_27_mode_0 = const()[name = string("input_27_mode_0"), val = string("EXACT")];
            tensor<fp16, [1, ?, 1536]> input_27_cast_fp16 = gelu(mode = input_27_mode_0, x = linear_8_cast_fp16)[name = string("input_27_cast_fp16")];
            tensor<fp16, [384, 1536]> decoder_layers_0_fc2_weight_to_fp16 = const()[name = string("decoder_layers_0_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(43730048)))];
            tensor<fp16, [384]> decoder_layers_0_fc2_bias_to_fp16 = const()[name = string("decoder_layers_0_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(44909760)))];
            tensor<fp16, [1, ?, 384]> linear_9_cast_fp16 = linear(bias = decoder_layers_0_fc2_bias_to_fp16, weight = decoder_layers_0_fc2_weight_to_fp16, x = input_27_cast_fp16)[name = string("linear_9_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_33_cast_fp16 = add(x = input_21_cast_fp16, y = linear_9_cast_fp16)[name = string("input_33_cast_fp16")];
            tensor<int32, [1]> hidden_states_11_axes_0 = const()[name = string("hidden_states_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_weight_to_fp16 = const()[name = string("decoder_layers_1_self_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(44910592)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_layer_norm_bias_to_fp16 = const()[name = string("decoder_layers_1_self_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(44911424)))];
            tensor<fp16, [1, ?, 384]> hidden_states_11_cast_fp16 = layer_norm(axes = hidden_states_11_axes_0, beta = decoder_layers_1_self_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_1_self_attn_layer_norm_weight_to_fp16, x = input_33_cast_fp16)[name = string("hidden_states_11_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(44912256)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = string("decoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(45207232)))];
            tensor<fp16, [1, ?, 384]> linear_10_cast_fp16 = linear(bias = decoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = string("linear_10_cast_fp16")];
            fp16 var_227_to_fp16 = const()[name = string("op_227_to_fp16"), val = fp16(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_17_cast_fp16 = mul(x = linear_10_cast_fp16, y = var_227_to_fp16)[name = string("tensor_17_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(45208064)))];
            tensor<fp16, [1, ?, 384]> linear_11_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = string("linear_11_cast_fp16")];
            tensor<int32, [4]> var_231 = const()[name = string("op_231"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_232_cast_fp16 = reshape(shape = var_231, x = linear_11_cast_fp16)[name = string("op_232_cast_fp16")];
            tensor<int32, [4]> var_233_perm_0 = const()[name = string("op_233_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(45503040)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = string("decoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(45798016)))];
            tensor<fp16, [1, ?, 384]> linear_12_cast_fp16 = linear(bias = decoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_11_cast_fp16)[name = string("linear_12_cast_fp16")];
            tensor<int32, [4]> var_238 = const()[name = string("op_238"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_239_cast_fp16 = reshape(shape = var_238, x = linear_12_cast_fp16)[name = string("op_239_cast_fp16")];
            tensor<int32, [4]> var_240_perm_0 = const()[name = string("op_240_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            bool key_states_13_interleave_0 = const()[name = string("key_states_13_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 6, ?, 64]> var_233_cast_fp16 = transpose(perm = var_233_perm_0, x = var_232_cast_fp16)[name = string("transpose_23")];
            tensor<fp16, [1, 6, ?, 64]> npk1 = concat(axis = var_26, interleave = key_states_13_interleave_0, values = (pk1, var_233_cast_fp16))[name = string("key_states_13_cast_fp16")];
            bool value_states_13_interleave_0 = const()[name = string("value_states_13_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 6, ?, 64]> var_240_cast_fp16 = transpose(perm = var_240_perm_0, x = var_239_cast_fp16)[name = string("transpose_22")];
            tensor<fp16, [1, 6, ?, 64]> npv1 = concat(axis = var_26, interleave = value_states_13_interleave_0, values = (pv1, var_240_cast_fp16))[name = string("value_states_13_cast_fp16")];
            tensor<int32, [4]> concat_8x = const()[name = string("concat_8x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_252_cast_fp16 = reshape(shape = concat_8x, x = tensor_17_cast_fp16)[name = string("op_252_cast_fp16")];
            tensor<int32, [4]> var_253_perm_0 = const()[name = string("op_253_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_255 = const()[name = string("op_255"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_253_cast_fp16 = transpose(perm = var_253_perm_0, x = var_252_cast_fp16)[name = string("transpose_21")];
            tensor<fp16, [6, ?, 64]> query_states_5_cast_fp16 = reshape(shape = var_255, x = var_253_cast_fp16)[name = string("query_states_5_cast_fp16")];
            tensor<int32, [3]> var_257 = const()[name = string("op_257"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, ?, 64]> key_states_15_cast_fp16 = reshape(shape = var_257, x = npk1)[name = string("key_states_15_cast_fp16")];
            tensor<int32, [3]> var_259 = const()[name = string("op_259"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [6, ?, 64]> value_states_15_cast_fp16 = reshape(shape = var_259, x = npv1)[name = string("value_states_15_cast_fp16")];
            bool attn_weights_9_transpose_x_1 = const()[name = string("attn_weights_9_transpose_x_1"), val = bool(false)];
            bool attn_weights_9_transpose_y_1 = const()[name = string("attn_weights_9_transpose_y_1"), val = bool(true)];
            tensor<fp16, [6, ?, ?]> attn_weights_9_cast_fp16 = matmul(transpose_x = attn_weights_9_transpose_x_1, transpose_y = attn_weights_9_transpose_y_1, x = query_states_5_cast_fp16, y = key_states_15_cast_fp16)[name = string("attn_weights_9_cast_fp16")];
            tensor<fp16, [6, ?, ?]> input_35_cast_fp16 = softmax(axis = var_27, x = attn_weights_9_cast_fp16)[name = string("input_35_cast_fp16")];
            bool attn_output_13_transpose_x_0 = const()[name = string("attn_output_13_transpose_x_0"), val = bool(false)];
            bool attn_output_13_transpose_y_0 = const()[name = string("attn_output_13_transpose_y_0"), val = bool(false)];
            tensor<fp16, [6, ?, 64]> attn_output_13_cast_fp16 = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_35_cast_fp16, y = value_states_15_cast_fp16)[name = string("attn_output_13_cast_fp16")];
            tensor<int32, [4]> concat_9x = const()[name = string("concat_9x"), val = tensor<int32, [4]>([1, 6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> attn_output_15_cast_fp16 = reshape(shape = concat_9x, x = attn_output_13_cast_fp16)[name = string("attn_output_15_cast_fp16")];
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = string("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_10x = const()[name = string("concat_10x"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, ?, 6, 64]> attn_output_17_cast_fp16 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast_fp16)[name = string("transpose_20")];
            tensor<fp16, [1, ?, 384]> input_37_cast_fp16 = reshape(shape = concat_10x, x = attn_output_17_cast_fp16)[name = string("input_37_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(45798848)))];
            tensor<fp16, [384]> decoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = string("decoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46093824)))];
            tensor<fp16, [1, ?, 384]> linear_13_cast_fp16 = linear(bias = decoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = decoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_37_cast_fp16)[name = string("linear_13_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_41_cast_fp16 = add(x = input_33_cast_fp16, y = linear_13_cast_fp16)[name = string("input_41_cast_fp16")];
            tensor<int32, [1]> hidden_states_15_axes_0 = const()[name = string("hidden_states_15_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46094656)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46095488)))];
            tensor<fp16, [1, ?, 384]> hidden_states_15_cast_fp16 = layer_norm(axes = hidden_states_15_axes_0, beta = decoder_layers_1_encoder_attn_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_1_encoder_attn_layer_norm_weight_to_fp16, x = input_41_cast_fp16)[name = string("hidden_states_15_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_q_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46096320)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_q_proj_bias_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46391296)))];
            tensor<fp16, [1, ?, 384]> linear_14_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_q_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_q_proj_weight_to_fp16, x = hidden_states_15_cast_fp16)[name = string("linear_14_cast_fp16")];
            fp16 var_294_to_fp16 = const()[name = string("op_294_to_fp16"), val = fp16(0x1p-3)];
            tensor<fp16, [1, ?, 384]> tensor_23_cast_fp16 = mul(x = linear_14_cast_fp16, y = var_294_to_fp16)[name = string("tensor_23_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_k_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46392128)))];
            tensor<fp16, [1, 1500, 384]> linear_15_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = decoder_layers_1_encoder_attn_k_proj_weight_to_fp16, x = encoder_output)[name = string("linear_15_cast_fp16")];
            tensor<int32, [4]> var_298 = const()[name = string("op_298"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_299_cast_fp16 = reshape(shape = var_298, x = linear_15_cast_fp16)[name = string("op_299_cast_fp16")];
            tensor<int32, [4]> var_300_perm_0 = const()[name = string("op_300_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_v_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46687104)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_v_proj_bias_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46982080)))];
            tensor<fp16, [1, 1500, 384]> linear_16_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_v_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_v_proj_weight_to_fp16, x = encoder_output)[name = string("linear_16_cast_fp16")];
            tensor<int32, [4]> var_305 = const()[name = string("op_305"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, 1500, 6, 64]> var_306_cast_fp16 = reshape(shape = var_305, x = linear_16_cast_fp16)[name = string("op_306_cast_fp16")];
            tensor<int32, [4]> var_307_perm_0 = const()[name = string("op_307_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> concat_11x = const()[name = string("concat_11x"), val = tensor<int32, [4]>([1, -1, 6, 64])];
            tensor<fp16, [1, ?, 6, 64]> var_315_cast_fp16 = reshape(shape = concat_11x, x = tensor_23_cast_fp16)[name = string("op_315_cast_fp16")];
            tensor<int32, [4]> var_316_perm_0 = const()[name = string("op_316_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_318 = const()[name = string("op_318"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> var_316_cast_fp16 = transpose(perm = var_316_perm_0, x = var_315_cast_fp16)[name = string("transpose_17")];
            tensor<fp16, [6, ?, 64]> query_states_7_cast_fp16 = reshape(shape = var_318, x = var_316_cast_fp16)[name = string("query_states_7_cast_fp16")];
            tensor<int32, [3]> var_320 = const()[name = string("op_320"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_300_cast_fp16 = transpose(perm = var_300_perm_0, x = var_299_cast_fp16)[name = string("transpose_19")];
            tensor<fp16, [6, 1500, 64]> key_states_19_cast_fp16 = reshape(shape = var_320, x = var_300_cast_fp16)[name = string("key_states_19_cast_fp16")];
            tensor<int32, [3]> var_322 = const()[name = string("op_322"), val = tensor<int32, [3]>([6, -1, 64])];
            tensor<fp16, [1, 6, 1500, 64]> var_307_cast_fp16 = transpose(perm = var_307_perm_0, x = var_306_cast_fp16)[name = string("transpose_18")];
            tensor<fp16, [6, 1500, 64]> value_states_19_cast_fp16 = reshape(shape = var_322, x = var_307_cast_fp16)[name = string("value_states_19_cast_fp16")];
            bool attn_weights_13_transpose_x_1 = const()[name = string("attn_weights_13_transpose_x_1"), val = bool(false)];
            bool attn_weights_13_transpose_y_1 = const()[name = string("attn_weights_13_transpose_y_1"), val = bool(true)];
            tensor<fp16, [6, ?, 1500]> attn_weights_13_cast_fp16 = matmul(transpose_x = attn_weights_13_transpose_x_1, transpose_y = attn_weights_13_transpose_y_1, x = query_states_7_cast_fp16, y = key_states_19_cast_fp16)[name = string("attn_weights_13_cast_fp16")];
            tensor<fp16, [6, ?, 1500]> input_43_cast_fp16 = softmax(axis = var_27, x = attn_weights_13_cast_fp16)[name = string("input_43_cast_fp16")];
            bool attn_output_19_transpose_x_0 = const()[name = string("attn_output_19_transpose_x_0"), val = bool(false)];
            bool attn_output_19_transpose_y_0 = const()[name = string("attn_output_19_transpose_y_0"), val = bool(false)];
            tensor<fp16, [6, ?, 64]> attn_output_19_cast_fp16 = matmul(transpose_x = attn_output_19_transpose_x_0, transpose_y = attn_output_19_transpose_y_0, x = input_43_cast_fp16, y = value_states_19_cast_fp16)[name = string("attn_output_19_cast_fp16")];
            tensor<int32, [4]> concat_12x = const()[name = string("concat_12x"), val = tensor<int32, [4]>([1, 6, -1, 64])];
            tensor<fp16, [1, 6, ?, 64]> attn_output_21_cast_fp16 = reshape(shape = concat_12x, x = attn_output_19_cast_fp16)[name = string("attn_output_21_cast_fp16")];
            tensor<int32, [4]> attn_output_23_perm_0 = const()[name = string("attn_output_23_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_13x = const()[name = string("concat_13x"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, ?, 6, 64]> attn_output_23_cast_fp16 = transpose(perm = attn_output_23_perm_0, x = attn_output_21_cast_fp16)[name = string("transpose_16")];
            tensor<fp16, [1, ?, 384]> input_45_cast_fp16 = reshape(shape = concat_13x, x = attn_output_23_cast_fp16)[name = string("input_45_cast_fp16")];
            tensor<fp16, [384, 384]> decoder_layers_1_encoder_attn_out_proj_weight_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(46982912)))];
            tensor<fp16, [384]> decoder_layers_1_encoder_attn_out_proj_bias_to_fp16 = const()[name = string("decoder_layers_1_encoder_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(47277888)))];
            tensor<fp16, [1, ?, 384]> linear_17_cast_fp16 = linear(bias = decoder_layers_1_encoder_attn_out_proj_bias_to_fp16, weight = decoder_layers_1_encoder_attn_out_proj_weight_to_fp16, x = input_45_cast_fp16)[name = string("linear_17_cast_fp16")];
            tensor<fp16, [1, ?, 384]> input_49_cast_fp16 = add(x = input_41_cast_fp16, y = linear_17_cast_fp16)[name = string("input_49_cast_fp16")];
            tensor<int32, [1]> input_51_axes_0 = const()[name = string("input_51_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> decoder_layers_1_final_layer_norm_weight_to_fp16 = const()[name = string("decoder_layers_1_final_layer_norm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(47278720)))];
            tensor<fp16, [384]> decoder_layers_1_final_layer_norm_bias_to_fp16 = const()[name = string("decoder_layers_1_final_layer_norm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(47279552)))];
            tensor<fp16, [1, ?, 384]> input_51_cast_fp16 = layer_norm(axes = input_51_axes_0, beta = decoder_layers_1_final_layer_norm_bias_to_fp16, epsilon = var_16_to_fp16, gamma = decoder_layers_1_final_layer_norm_weight_to_fp16, x = input_49_cast_fp16)[name = string("input_51_cast_fp16")];
            tensor<fp16, [1536, 384]> decoder_layers_1_fc1_weight_to_fp16 = const()[name = string("decoder_layers_1_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(47280384)))];
            tensor<fp16, [1536]> decoder_layers_1_fc1_bias_to_fp16 = const()[name = string("decoder_layers_1_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(48460096)))];
            tensor<fp16, [1, ?, 1536]> linear_18_cast_fp16 = linear(bias = decoder_layers_1_fc1_bias_to_fp16, weight = decoder_layers_1_fc1_weight_to_fp16, x = input_51_cast_fp16)[name = string("linear_18_cast_fp16")];
            string input_55_mode_0 = const()[name = string("input_55_mode_0"), val = string("EXACT")];
            tensor<fp16, [1, ?, 1536]> input_55_cast_fp16 = gelu(mode = input_55_mode_0, x = linear_18_cast_fp16)[name = string("input_55_cast_fp16")];
